Repository: dvarrazzo/pgmessages
Catalog: */ecpg.po
Languages: es

source: variable %s: numeric type needed
es: variable %s: se necesita un tipo numerico

source: unknown descriptor %s
es: descriptor %s desconocido

source: unknown descriptor header item "%d"
es: elemento del encabezado del descriptor «%d» desconocido

source: nullable is always 1
es: nullable es siempre 1

source: key_member is always 0
es: key_member es siempre 0

source: descriptor item %s is not implemented
es: elemento del descriptor %s no está implementado

source: descriptor item %s cannot be set
es: no se pudo establecer el elemento del descriptor %s

source: %s is the PostgreSQL embedded SQL preprocessor for C programs.
es: %s es el preprocesador de SQL para programas en C de Postgresql.

source: Usage: %s [OPTION]... FILE...
es: Utilice: %s [OPCIÓN]... ARCHIVO...

source: Options:
es: Opciones:

source: -c automatically generate C code from embedded SQL code; currently this works for EXEC SQL TYPE
es: -c genera automáticamente código en C desde código SQL embebido; actualmente trabaja para EXEC SQL TYPE

source: -C MODE set compatibility mode; MODE can be one of "INFORMIX", "INFORMIX_SE"
es: -C MODE establece el modo de compatibilidad; MODE puede ser "INFORMIX", "INFORMIX_SE"

source: -d generate parser debug output
es: -d genera salida depurada del analizador

source: -h parse a header file, this option includes option "-c"
es: -h analiza el encabezado de un archivo, esta opción incluye "-c"

source: -i parse system include files as well
es: -i analiza los archivos de inclusión de sistema

source: -I DIRECTORY search DIRECTORY for include files
es: -I DIRECTORIO busca el DIRECTORIO para los archivos incluidos

source: -o OUTFILE write result to OUTFILE
es: -o ARCHIVO escribe el resultado de la salida al ARCHIVO

source: -r OPTION specify runtime behaviour; OPTION can be: "no_indicator" "prepare" "questionmarks"
es: -r OPCIÓN especifíca el comportamiento en tiempo de ejecución; OPCIÓN puede ser: "no_indicator" "prepare" "questionmarks"

source: -t turn on autocommit of transactions
es: -t establece encendido el cometedor automático de las transacciones

source: --help show this help, then exit
es: --help muestra esta ayuda, luego sale

source: --regression run in regression testing mode
es: --regression ejecución en modo de testeo de regresión

source: --version output version information, then exit
es: --version muestra información de la versión, luego sale

source: If no output file is specified, the name is formed by adding .c to the input file name, after stripping off .pgc if present.
es: Si no se especifica un archivo de salida, el nombre se forma agregando .c al archivo de entrada, luego de sacar .pgc si esta presente.

source: Report bugs to <pgsql-bugs@postgresql.org>.
es: Reporte los errores a <pgsql-bugs@postgresql.org>.

source: %s: could not open file "%s": %s
es: %s: no se pudo abrir el archivo «%s»: %s

source: Try "%s --help" for more information.
es: Intente «%s --help» para mayor información.

source: %s: parser debug support (-d) not available
es: %s: soporte del depurador analizador (-d) no está disponible

source: %s, the PostgreSQL embedded C preprocessor, version %d.%d.%d
es: %s, el preprocesador de C embebido de Postgresql, versión %d.%d.%d

source: exec sql include ... search starts here:
es: exec sql include ... la búsqueda comienza aquí:

source: end of search list
es: final de la lista de búsqueda

source: %s: no input files specified
es: %s: no se especificaron archivos de entrada

source: cursor "%s" has been declared but not opened
es: el cursor «%s» fue declarado pero no abierto

source: unterminated /* comment
es: comentario /* no cerrado

source: invalid bit string input
es: entrada de bit de cadena no es válido

source: unterminated bit string
es: cadena de bits no terminada

source: unterminated hexadecimal integer
es: entero hexadecimal no terminado

source: unterminated quoted string
es: cadena citada no terminada

source: zero-length delimited identifier
es: identificador delimitado como longitud cero

source: unterminated quoted identifier
es: identificador citado no terminado

source: missing identifier in 'EXEC SQL UNDEF' command
es: falta el identificador en el comando 'EXEC SQL UNDEF'

source: missing matching 'EXEC SQL IFDEF / EXEC SQL IFNDEF'
es: no concuerdan la comparación 'EXEC SQL IFDEF / EXEC SQL IFNDEF'

source: missing 'EXEC SQL ENDIF;'
es: falta 'EXEC SQL ENDIF;'

source: duplicated 'EXEC SQL ELSE;'
es: 'EXEC SQL ELSE;' duplicado

source: unmatched 'EXEC SQL ENDIF;'
es: no se encontró 'EXEC SQL ENDIF;'

source: too many nested 'EXEC SQL IFDEF' conditions
es: demasiadas condiciones 'EXEC SQL IFDEF' anidadas

source: missing identifier in 'EXEC SQL IFDEF' command
es: identificador faltante en el comando 'EXEC SQL IFDEF'

source: missing identifier in 'EXEC SQL DEFINE' command
es: identificador faltante en el comando 'EXEC SQL DEFINE'

source: incorrect 'EXEC SQL INCLUDE' command
es: comando 'EXEC SQL INCLUDE' incorrecto

source: Internal error: unreachable state, please report this to <pgsql-bugs@postgresql.org>
es: Error Interno: estado no esperado, reporte el presente a <pgsql-bugs@postgresql.org>

source: Error: Path %s/%s is too long on line %d, skipping
es: Error: Ruta %s/%s es demasiada larga en la linea %d, omitiendo

source: cannot open include file "%s" on line %d
es: no se pudo incluir el archivo «%s» en la linea%d

source: WARNING:
es: CUIDADO

source: could not remove output file "%s"
es: no se pudo eliminar el archivo de salida «%s»

source: trying to access an undeclared cursor "%s"
es: tratando acceder a un cursor no declarado «%s»

source: initializer not allowed in typedef command
es: inicializador no permitido en el comando typedef

source: type %s already defined
es: el tipo %s ya está definido

source: no multidimensional array support for simple data types
es: no se soporta arreglos multidimensionales para tipos de datos simples

source: no at option for close database statement
es: no es una opción para la sentencia de cierre de base de datos

source: no at option for deallocate statement
es: no es una opción para la sentencia de desasignar

source: no at option for connect statement
es: no es una opción para la sentencia de conexión

source: no at option for disconnect statement
es: no es una opción para la sentencia de desconexión

source: no at option for set connection statement
es: no es una opción para la sentencia de establecimiento de conexión

source: no at option for typedef statement
es: no es una opción para la sentencia de definición de tipos

source: no at option for var statement
es: no es una opción para la sentencia var

source: unsupported feature will be passed to backend
es: característica no soportada será pasada al cliente

source: SHOW ALL not implemented
es: no está implementada SHOW ALL

source: copy to stdin not possible
es: no fué posible copiar a la entrada estándar

source: copy from stdout not possible
es: no fué posible copiar a la salida estándar

source: copy from stdin not implemented
es: no fue implementada la copia desde la entrada estándar

source: INITIALLY DEFERRED constraint must be DEFERRABLE
es: la restricción INITIALLY DEFERRED debe ser DEFERRABLE

source: cursor "%s" already defined
es: el cursor «%s» ya fué definido

source: no longer supported LIMIT #,# syntax passed to backend
es: ya no se soporta sintáxis LIMIT #,# pasada al cliente

source: sub-SELECT in FROM must have an alias
es: subconsulta en la cláusula FROM debe tener un alias

source: OLD used in non-rule query
es: OLD utilizada en una consulta que no es una regla

source: NEW used in non-rule query
es: NEW utilizada en una consulta que no es una regla

source: CREATE TABLE / AS SELECT cannot specify INTO
es: no se puede especificar INTO en CREATE TABLE / AS SELECT

source: expected "@", found "%s"
es: se esperaba «@», se encontró «%s»

source: only protocols "tcp" and "unix" and database type "postgresql" are supported
es: solo los protocolos «tcp» y «unix» y tipo de bases de datos «postgresql» son soportados

source: expected "://", found "%s"
es: se esperaba «://», se encontró «%s»

source: unix domain sockets only work on "localhost" but not on "%s"
es: los sockets de dominio unix solo trabajan en «localhost» pero no en «%s»

source: expected "postgresql", found "%s"
es: se esperaba «postgresql», se encontró «%s»

source: illegal connection type %s
es: tipo de conexión ilegal %s

source: expected "@" or "://", found "%s"
es: se esperaba «@» o «://», se encontró «%s»

source: invalid datatype
es: tipo de dato inválido

source: incomplete statement
es: sentencia incompleta

source: cursor "%s" already defined
es: el cursor «%s» ya estaba definido

source: only numeric/decimal have precision/scale argument
es: solo numeric/decimal tienen argumento de presición/escala

source: interval specification not allowed here
es: especificación de intervalo no está permitida aquí

source: too many levels in nested structure/union definition
es: demasiados niveles en la definición de estructura/unión

source: type "%s" already defined
es: tipo «%s» ya estaba definido

source: pointer to varchar are not implemented
es: puntero a varchar no implementado

source: using unsupported describe statement
es: utilizando sentencia descriptiva no soportada

source: initializer not allowed in EXEC SQL VAR command
es: inicializador no permitido en comando EXEC SQL VAR

source: arrays of indicators are not allowed on input
es: arreglod eindicadores no permitidos en la entrada

source: %s at or near "%s"
es: %s en o cerca «%s»

source: out of memory
es: fuera de memoria

source: illegal variable type %d
es: tipo de variable ilegal %d

source: indicator for array/pointer has to be array/pointer
es: indicador para arreglo/puntero debe ser arreglo/puntero

source: no nested arrays allowed (except strings)
es: no se permiten arreglos anidados (excepto cadenas de caracter)

source: indicator for struct has to be struct
es: indicador para estructura debe ser una estructura

source: indicator for simple datatype has to be simple
es: indicardor para dato simple debe ser un dato simple

source: illegal descriptor item %d
es: elemento de descripción ilegal %d

source: incorrectly formed variable %s
es: variable conformada incorrectamente %s

source: variable %s is not a pointer
es: la variable %s no es un puntero

source: variable %s is not a pointer to a structure or a union
es: la variable %s no es un puntero a una estructura o unión

source: variable %s is neither a structure nor a union
es: la variable %s no es ní una estructura o unión

source: variable %s is not an array
es: la variable %s no es un arreglo

source: variable %s is not declared
es: la variable %s no está declarada

source: indicator variable must be integer type
es: el indicador de la variable debe ser de tipo integer

source: invalid datatype "%s"
es: tipo de dato no válido «%s»

source: no multidimensional array support
es: no se soportan arreglos multidimensionales

source: no multilevel (more than 2) pointer supported %d
es: no se soporta punteros multinivel (más de 2) %d

source: no pointer to pointer supported for this type
es: no se soporta puntero a puntero para este tipo de dato

source: no multidimensional array support for structures
es: no se soporta arreglos multidimensionales para estructuras
