Repository: dvarrazzo/pgmessages
Catalog: */ecpglib.po
Languages: es

source: empty message text
es: mensaje de texto vacío

source: no data found on line %d
es: no se encontraron datos en la linea %d

source: out of memory on line %d
es: fuera de memoria en linea %d

source: unsupported type "%s" on line %d
es: tipo no soportado «%s» en linea %d

source: too many arguments on line %d
es: demasiados argumentos en la linea %d

source: too few arguments on line %d
es: pocos argumentos en la linea %d

source: invalid input syntax for type int: "%s", on line %d
es: sintáxis de entrada no válida para el tipo entero: «%s», en linea %d

source: invalid input syntax for type unsigned int: "%s", on line %d
es: sintáxis de entrada no válida para el tipo entero sin signo: «%s», en linea %d

source: invalid input syntax for floating-point type: "%s", on line %d
es: sintáxis de entrada no válida para el tipo coma flotante: «%s», en linea %d

source: invalid syntax for type boolean: "%s", on line %d
es: sintáxis no válida para el tipo booleano: «%s», en linea %d

source: could not convert boolean value: size mismatch, on line %d
es: no se puede convertir el valor booleano: tamaño incorrecto, en linea %d

source: empty query on line %d
es: consulta vacía en linea %d

source: null value without indicator on line %d
es: valor nulo sin indicador en linea %d

source: variable does not have an array type on line %d
es: la variable no tiene un tipo de arreglo en linea %d

source: data read from server is not an array on line %d
es: dato leído del servidor no es un arrglo en linea %d

source: inserting an array of variables is not supported on line %d
es: inserción un arreglo de variables no está soportado en linea %d

source: connection "%s" does not exist on line %d
es: conexión «%s» no existe en linea %d

source: not connected to connection "%s" on line %d
es: no conectada a la conexión «%s» en linea %d

source: invalid statement name "%s" on line %d
es: nombre sentencia no válida «%s» en linea %d

source: descriptor "%s" not found on line %d
es: descriptor «%s» no encontrado en linea %d

source: descriptor index out of range on line %d
es: índice descriptor fuera de rando en linea %d

source: unrecognized descriptor item "%s" on line %d
es: elemento descriptor no reconocido «%s» en linea %d

source: variable does not have a numeric type on line %d
es: la variable no tiene un tipo numérico en linea %d

source: variable does not have a character type on line %d
es: la variable no tiene un tipo caracter en linea %d

source: error in transaction processing on line %d
es: error en el procesamiento de la transacción en linea %d

source: could not connect to database "%s" on line %d
es: no se pudo conectar con la base de datos «%s» en linea %d

source: SQL error %d on line %d
es: error SQL %d en linea %d

source: SQL error: %s
es: error SQL: %s

source: NULL
es: NULO
