Repository: dvarrazzo/pgmessages
Catalog: */initdb.po
Languages: pl, ro

source: %s: out of memory
pl: %s: brak pamiêci
ro: %s: memorie insuficientã

source: %s: could not open file "%s" for reading: %s
pl: %s: nie mo¿na otworzyæ pliku "%s" do odczytu: %s
ro: %s: imposibil de deschis fiºierul "%s" pentru citire: %s

source: %s: could not open file "%s" for writing: %s
pl: %s: nie mo¿na otworzyæ pliku "%s" do zapisu: %s
ro: %s: imposibil de deschis fiºierul "%s" pentru scriere: %s

source: %s: could not write file "%s": %s
pl: %s: nie mo¿na zapisaæ pliku "%s": %s
ro: %s: imposibil de scris fiºierul "%s": %s

source: %s: could not execute command "%s": %s
pl: %s: nie mo¿na wykonaæ komendy "%s": %s
ro: %s: imposibil de executat comanda"%s": %s

source: %s: removing data directory "%s"
pl: %s: usuwanie katalogu danych "%s"
ro: %s: eliminare director de date "%s"

source: %s: failed to remove data directory
pl: %s: nie uda³o siê usuniêcie katalogu danych
ro: %s: eliminare director de date eºuatã

source: %s: removing contents of data directory "%s"
pl: %s: usuwanie zawarto¶ci w katalogu danych "%s"
ro: %s: eliminare conþinut al directorului de date "%s"

source: %s: failed to remove contents of data directory
pl: %s: nie uda³o siê usun±æ zawarto¶ci w katalogu danych
ro: %s: eliminare conþinut al directorului de date eºuatã

source: %s: removing transaction log directory "%s"
pl: %s: usuwanie katalogu logów transakcji "%s"

source: %s: failed to remove transaction log directory
pl: %s: nie uda³o siê usuniêcie katalogu logów transakcji

source: %s: removing contents of transaction log directory "%s"
pl: %s: usuwanie zawarto¶ci katalogu logów transakcji "%s"

source: %s: failed to remove contents of transaction log directory
pl: %s: nie uda³o siê usun±æ zawarto¶ci w katalogu logów transakcji

source: %s: data directory "%s" not removed at user's request
pl: %s: katalog "%s" nie zosta³ usuniêty na ¿±danie u¿ytkownika
ro: %s: directorul de date "%s" nu a fost eliminat la solicitarea utilizatorului

source: %s: transaction log directory "%s" not removed at user's request
pl: %s: katalog "%s" nie zosta³ usuniêty na ¿±danie u¿ytkownika

source: %s: cannot be run as root Please log in (using, e.g., "su") as the (unprivileged) user that will own the server process.
pl: %s: nie mo¿na uruchomiæ jako root Proszê zalogowaæ siê (u¿ywaj±c np: "su") na (nieuprzywilejowanego) u¿ytkownika który bêdzie w³a¶cicielem procesu.
ro: %s: nu poate fi rulat ca root Autentificaþi-vã (folosind, de exempu, "su") ca utilizatorul (neprivilegiat) care va deþine procesul server.

source: %s: could not obtain information about current user: %s
pl: %s: nie mo¿na uzyskaæ informacji o bie¿±cym u¿ytkowniku: %s

source: %s: could not get current user name: %s
pl: %s: nie mo¿na pobraæ nazwy bie¿±cego u¿ytkownika: %s

source: %s: "%s" is not a valid server encoding name
pl: %s: "%s" nie jest poprawn± nazw± kodowania
ro: %s: "%s" nu este un nume valid de codificare pentru server

source: %s: could not create directory "%s": %s
pl: %s: nie mo¿na utworzyæ katalogu "%s": %s
ro: %s: imposibil de creat directorul "%s": %s

source: %s: file "%s" does not exist
pl: %s: plik "%s" nie istnieje

source: This might mean you have a corrupted installation or identified the wrong directory with the invocation option -L.
pl: Oznacza to i¿ posiadasz uszkodzon± instalacjê lub wskaza³e¶ z³y katalog przy u¿yciu opcji -L.

source: %s: could not access file "%s": %s
pl: %s: nie mo¿na uzyskaæ dostêpu do pliku "%s": %s

source: %s: file "%s" is not a regular file
pl: %s: plik "%s" nie jest zwyk³ym plikiem

source: selecting default max_connections ...
pl: wybieranie domy¶lnej warto¶ci max_connections ...
ro: selectare valoare implicitã pentru max_connections ...

source: selecting default shared_buffers ...
pl: wybieranie domy¶lnej warto¶ci shared_buffers ...
ro: selectare valoare implicitã pentru shared_buffers ...

source: creating configuration files ...
pl: tworzenie plików konfiguracyjnych ...
ro: creare fiºiere de configurare ...

source: creating template1 database in %s/base/1 ...
pl: tworzenie bazy template1 w folderze %s/base/1 ...
ro: creare bazã de date template1 în %s/base/1 ...

source: %s: input file "%s" does not belong to PostgreSQL %s Check your installation or specify the correct path using the option -L.
pl: %s: plik wej¶ciowy "%s" nie nale¿y do bazy danych PostgreSQL %s Sprawd¼ swoj± instalacjê lub podaj popraw± ¶cie¿kê przy pomocy opcji -L.
ro: %s: fiºierul de intrare "%s" nu aparþine de PostgreSQL %s Verificaþi instalarea sau specificaþi calea corectã folosind opþiunea -L.

source: initializing pg_authid ...
pl: inicjowanie pg_authid ...

source: Enter new superuser password:
pl: Podaj has³o superu¿ytkownika:
ro: Introduceþi noua parolã pentru utilizatorul privilegiat:

source: Enter it again:
pl: Powtórz podane has³o:
ro: Introduceþi din nou:

source: Passwords didn't match.
pl: Podane has³a ró¿ni± siê.
ro: Parola nu se verificã

source: %s: could not read password from file "%s": %s
pl: %s: nie mo¿na odczytaæ has³a z pliku "%s": %s
ro: %s: imposibil de citit parola din fiºierul "%s": %s

source: setting password ...
pl: ustawianie has³a ...
ro: setare parolã ...

source: initializing dependencies ...
pl: inicjowanie powi±zañ ...

source: creating system views ...
pl: tworzenie widoków systemowych ...
ro: creare vizualizãri sistem ...

source: loading system objects' descriptions ...
pl: wczytywanie opisów obiektów systemowych ...

source: creating collations ...
pl: tworzenie porównañ ...

source: %s: locale name too long, skipped: %s
pl: %s: nazwa lokalizacji zbyt d³uga, pominiêto: %s

source: %s: locale name has non-ASCII characters, skipped: %s
pl: %s: nazwa lokalizacji zawiera znak spoza ASCII, pominiêto: %s

source: No usable system locales were found.
pl: Nie znaleziono lokalizacji systemowej nadaj±cej siê do wykorzystania.

source: Use the option "--debug" to see details.
pl: U¿yj opcji "--debug" by zobaczyæ szczegó³y.

source: not supported on this platform
pl: nieobs³ugiwane na tej platformie

source: creating conversions ...
pl: tworzenie konwersji ...
ro: creare conversii ...

source: creating dictionaries ...
pl: tworzenie s³owników ...

source: setting privileges on built-in objects ...
pl: ustawianie uprawnieñ dla wbudowanych obiektów ...
ro: setare privilegii pentru obiectele predefinite ...

source: creating information schema ...
pl: tworzenie schematu informacyjnego ...
ro: creare schemã de informaþii ...

source: loading PL/pgSQL server-side language ...
pl: pobieranie jêzyka PL/pgSQL u¿ywanego po stronie serwera ...

source: vacuuming database template1 ...
pl: czyszczenie bazy template1 ...
ro: vidare bazã de date template1 ...

source: copying template1 to template0 ...
pl: kopiowanie bazy template1 do bazy template0 ...
ro: copiere template1 în template0 ...

source: copying template1 to postgres ...
pl: kopiowanie bazy template1 do bazy postgres ...

source: caught signal
pl: sygna³ otrzymany
ro: interceptare semnal

source: could not write to child process: %s
pl: nie mo¿na zapisaæ do procesu potomnego: %s
ro: imposibil de scris în procesul fiu: %s

source: %s: invalid locale name "%s"
pl: %s: b³êdna nazwa lokalizacji "%s"
ro: %s: nume de localizare incorect "%s"

source: %s: encoding mismatch
pl: %s: niezgodno¶æ kodowania

source: The encoding you selected (%s) and the encoding that the selected locale uses (%s) do not match. This would lead to misbehavior in various character string processing functions. Rerun %s and either do not specify an encoding explicitly, or choose a matching combination.
pl: Wybrane kodowanie (%s) i kodowanie u¿ywane przez lokalizacjê (%s) nie zgadzaj± siê. Mo¿e to prowadziæ do b³êdów w wielu funkcjach przetwarzaj±cych ci±gi znaków. Aby poprawiæ ten b³±d uruchom ponownie %s i albo nie ustawiaj kodowania albo wybierz pasuj±c± kombinacjê.

source: %s initializes a PostgreSQL database cluster.
pl: %s inicjuje klaster bazy danych PostgreSQL.
ro: %s iniþializeazã un grup de baze de date PostgreSQL.

source: Usage:
pl: Sk³adnia:
ro: Utilizare:

source: %s [OPTION]... [DATADIR]
pl: %s [OPCJA]... [KATALOG-DOCELOWY]
ro: %s [OPÞIUNE]... [DIRDATE]

source: Options:
pl: Opcje:
ro: Opþiuni:

source: -A, --auth=METHOD default authentication method for local connections
pl: -A, --auth=METODA podstawowa metoda autoryzacji dla po³±czeñ lokalnych
ro: -A, --auth=METODÃ metoda de autentificare implicitã pentru conexiunile locale

source: [-D, --pgdata=]DATADIR location for this database cluster
pl: [-D, --pgdata=]FOLDERDANYCH lokalizacja klastra bazy danych
ro: [-D, --pgdata=]DIRDATE locaþia pentru acest grup de baze de date

source: -E, --encoding=ENCODING set default encoding for new databases
pl: -E, --encoding=KODOWANIE ustawia domy¶lne kodowanie dla nowych baz danych
ro: -E, --encoding=CODIFICARE seteazã codificarea implicitã pentru bazele de date noi

source: --locale=LOCALE set default locale for new databases
pl: --locale=LOKALIZACJA ustawia domy¶ln± lokalizacjê dla nowych baz danych

source: --lc-collate=, --lc-ctype=, --lc-messages=LOCALE --lc-monetary=, --lc-numeric=, --lc-time=LOCALE set default locale in the respective category for new databases (default taken from environment)
pl: --lc-collate, --lc-ctype, --lc-messages=LOCALE --lc-monetary, --lc-numeric, --lc-time=LOCALE ustawia domy¶ln± lokalizacjê w odpowiedniej kategorii dla nowych baz danych (domy¶lnie pobierana ze ¶rodowiska)

source: --no-locale equivalent to --locale=C
pl: --no-locale równowa¿na z opcj± --locale=C

source: --pwfile=FILE read password for the new superuser from file
pl: --pwfile=PLIK czyta has³o dla w³a¶ciciela bazy z pliku

source: -T, --text-search-config=CFG default text search configuration
pl: -T, --text-search-config=CFG domy¶lna konfiguracja wyszukiwania tekstowego

source: -U, --username=NAME database superuser name
pl: -U, --username=NAZWA w³a¶ciciel bazy danych
ro: -U, --username=NUME nume utilizator privilegiat pentru baza de date

source: -W, --pwprompt prompt for a password for the new superuser
pl: -W, --pwprompt pro¶ o has³o dla w³a¶ciciela bazy danych
ro: -W, --pwprompt solicitare parolã pentru noul utilizator privilegiat

source: -X, --xlogdir=XLOGDIR location for the transaction log directory
pl: -X, --xlogdir=XLOGDIR umiejscowienie folderu logów transakcji

source: Less commonly used options:
pl: Rzadziej u¿ywane opcje:
ro: Opþiuni mai puþin folosite:

source: -d, --debug generate lots of debugging output
pl: -d, --debug wy¶wietlanie informacji debuggera
ro: -d, --debug genereazã mesaje pentru depanare

source: -L DIRECTORY where to find the input files
pl: -L KATALOG gdzie szukaæ plików wej¶ciowych
ro: -L DIRECTOR locaþia fiºierele de intrare

source: -n, --noclean do not clean up after errors
pl: -n, --noclean nie porz±dkowaæ po b³êdach
ro: -n, --noclean nu se face curat dupã erori

source: -s, --show show internal settings
pl: -s, --show poka¿ wewnêtrzne ustawienia
ro: -s, --show afiºeazã setãrile interne

source: Other options:
pl: Pozosta³e opcje:

source: -?, --help show this help, then exit
pl: -?, --help poka¿ t± pomoc i zakoñcz dzia³anie
ro: -?, --help afiºeazã acest mesaj de ajutor, apoi iese

source: -V, --version output version information, then exit
pl: -V, --version poka¿ informacje o wersji i zakoñcz
ro: -V, --version afiºeazã informaþiile despre versiune, apoi iese

source: If the data directory is not specified, the environment variable PGDATA is used.
pl: Je¶li katalog danych nie jest wskazany, u¿ywana jest zmienna ¶rodowiskowa PGDATA.
ro: Dacã nu este specificat directorul de date, este folositã variabila de mediu PGDATA.

source: Report bugs to <pgsql-bugs@postgresql.org>.
pl: B³êdy proszê przesy³aæ na adres <pgsql-bugs@postgresql.org>.
ro: Raportaþi erorile la <pgsql-bugs@postgresql.org>.

source: Running in debug mode.
pl: Dzia³anie w trybie debug.
ro: Rulare în mod depanare.

source: Running in noclean mode. Mistakes will not be cleaned up.
pl: Dzia³anie w trybie nonclean. B³êdy nie bêd± porz±dkowane.
ro: Rulare în mod "noclean". Greºelile nu vor fi corectate.

source: Try "%s --help" for more information.
pl: Spróbuj "%s --help" aby uzykaæ wiecej informacji.
ro: Încercaþi "%s --help" pentru mai multe informaþii.

source: %s: too many command-line arguments (first is "%s")
pl: %s: za du¿a ilo¶æ parametrów (pierwszy to "%s")
ro: %s: prea multe argumente în linia de comandã (primul este "%s")

source: %s: password prompt and password file cannot be specified together
pl: %s: pro¶ba o has³o i plik has³a nie mog± byæ podane jednocze¶nie

source: WARNING: enabling "trust" authentication for local connections You can change this by editing pg_hba.conf or using the -A option the next time you run initdb.
pl: UWAGA: metoda autoryzacji "trust" ustawiona dla po³±czeñ lokalnych. Metodê autoryzacji mo¿esz zmieniæ edytuj±c plik pg_hba.conf lub u¿ywaj±c opcji -A przy kolejnym uruchomieniu initdb.
ro: AVERTISMENT: activare autentificare "trust" pentru conexiunile locale Puteþi modifica acest lucru editând pg_hba.conf sau folosind opþiunea -A la urmãtoarea rulare a initdb.

source: %s: unrecognized authentication method "%s"
pl: %s: nierozpoznany sposób autoryzacji "%s"
ro: %s: metodã de autentificare nerecunoscutã "%s"

source: %s: must specify a password for the superuser to enable %s authentication
pl: %s: musisz podaæ has³o superu¿ytkownika aby aktywowaæ autoryzacjê %s
ro: %s: trebuie sã specificaþi o parolã pentru utilizatorul privilegiat pentru a activa autentificarea %s

source: %s: no data directory specified You must identify the directory where the data for this database system will reside. Do this with either the invocation option -D or the environment variable PGDATA.
pl: %s: nieustawiony katalog danych Musisz podaæ katalog gdzie bêd± przechowywane dane bazy danych. Mo¿esz tego dokonaæ u¿ywaj±c opcji -D lub przy pomocy zmiennej ¶rodowiskowej PGDATA.
ro: %s: nici un director de date specificat Trebuie sã identificaþi un director în care vor sta datele pentru acest sistem de baze de date. Puteþi face acest lucru folosind opþiunea -D sau variabila de mediu PGDATA.

source: The program "postgres" is needed by %s but was not found in the same directory as "%s". Check your installation.
pl: Program "postgres" jest wymagany przez %s ale nie zosta³ znaleziony w tym samym folderze co "%s". Sprawd¼ instalcjê.
ro: Programul "postgres" este necesar pentru %s, dar nu a fost gãsit în acelaºi director cu "%s". Verificaþi instalarea.

source: The program "postgres" was found by "%s" but was not the same version as %s. Check your installation.
pl: Program "postgres" zosta³ znaleziony przez "%s" ale nie jest w tej samej wersji co %s. Sprawd¼ instalacjê.
ro: Pogramul "postgres" a fost gãsit de "%s", dar nu are aceeaºi versiune ca %s. Verificaþi instalarea.

source: %s: input file location must be an absolute path
pl: %s: lokalizacja plików wej¶ciowych musi byæ bezwzglêdna
ro: %s: locaþia fiºierului de intrare trebuie sã fie o cale absolutã

source: The files belonging to this database system will be owned by user "%s". This user must also own the server process.
pl: W³a¶cicielem plików nale¿±cych do sytemu bazy danych bêdzie u¿ytkownik "%s". Ten u¿ytkownik musi jednocze¶nie byæ w³a¶cicielem procesu serwera.
ro: Fiºierele acestui sistem de baze de date vor aparþine utilizatorului "%s". Acest utilizator trebuie sã deþinã ºi procesul serverului.

source: The database cluster will be initialized with locale %s.
pl: Klaster bazy zostanie utworzony z zestawem regu³ jêzykowych %s.
ro: Grupul de baze de date va fi iniþializat cu localizarea %s.

source: The database cluster will be initialized with locales COLLATE: %s CTYPE: %s MESSAGES: %s MONETARY: %s NUMERIC: %s TIME: %s
pl: Klaster bazy danych zostanie utowrzony z zestawem regu³ jêzykowych COLLATE: %s CTYPE: %s MESSAGES: %s MONETARY: %s NUMERIC: %s TIME: %s
ro: Grupul de baze de date va fi iniþializat cu localizãrile COLLATE: %s CTYPE: %s MESSAGES: %s MONETARY: %s NUMERIC: %s TIME: %s

source: %s: could not find suitable encoding for locale %s
pl: %s: nie mo¿na znale¼æ odpowiedniego kodowania dla lokalizacji %s

source: Rerun %s with the -E option.
pl: W³±cz polecenie %s ponownie z opcj± -E.
ro: Re-rulaþi %s cu opþiunea -E.

source: Encoding %s implied by locale is not allowed as a server-side encoding. The default database encoding will be set to %s instead.
pl: Kodowanie %s okre¶lone przez lokalizacjê jest niedozwolone jako kodowanie po stronie serwera. Kodowanie bazy danych bêdzie zamiast tego ustawiona na %s.

source: %s: locale %s requires unsupported encoding %s
pl: %s: lokalizacja %s wymaga nie wspieranego kodowania %s

source: Encoding %s is not allowed as a server-side encoding. Rerun %s with a different locale selection.
pl: Kodowanie %s jest niedozwolone jako kodowanie po stronie serwera. Uruchom ponownie %s z wybran± inn± lokalizacj±.

source: The default database encoding has accordingly been set to %s.
pl: Domy¶lne kodowanie bazy danych zosta³o ustawione jako %s.
ro: Codificarea implicitã a bazei de date a fost setatã în mod corespunzãtor la %s.

source: %s: could not find suitable text search configuration for locale %s
pl: %s: nie mo¿na znale¼æ odpowiedniej konfiguracji wyszukiwania tekstowego dla lokalizacji %s

source: %s: warning: suitable text search configuration for locale %s is unknown
pl: %s: ostrze¿enie: nie jest znana odpowiednia konfiguracja wyszukiwania tekstowego dla lokalizacji %s

source: %s: warning: specified text search configuration "%s" might not match locale %s
pl: %s: ostrze¿enie: wskazana konfiguracja wyszukiwania tekstu "%s" mo¿e nie pasowaæ do lokalizacji %s

source: The default text search configuration will be set to "%s".
pl: Domy¶lna konfiguracja wyszukiwania tekstowego zostanie ustawiona na "%s".

source: creating directory %s ...
pl: tworzenie katalogu %s ...
ro: creare director %s ...

source: fixing permissions on existing directory %s ...
pl: ustalanie uprawnieñ katalogu %s ...
ro: stabilire permisiuni pentru directorul existent %s ...

source: %s: could not change permissions of directory "%s": %s
pl: %s: nie mo¿na zmieniæ uprawnieñ katalogu "%s": %s
ro: %s: imposibil de schimbat drepturile de acces pentru directorul "%s": %s

source: %s: directory "%s" exists but is not empty
pl: %s: katalog "%s" nie jest pusty

source: If you want to create a new database system, either remove or empty the directory "%s" or run %s with an argument other than "%s".
pl: Je¶li chcesz utworzyæ now± bazê danych usuñ lub wyczy¶æ, katalog "%s" lub uruchom program %s z argumentem wskazuj±cym katalog innym ni¿ "%s".

source: %s: could not access directory "%s": %s
pl: %s: brak dostêpu do katalogu "%s": %s
ro: %s: imposibil de accesat directorul "%s": %s

source: %s: transaction log directory location must be an absolute path
pl: %s: umiejscowienie folderu logów transakcji musi byæ ¶cie¿k± bezwzglêdn±

source: If you want to store the transaction log there, either remove or empty the directory "%s".
pl: Je¶li chcesz tam przechowywaæ logi transakcji, albo usuñ albo wyczy¶æ zawarto¶æ folderu "%s".

source: %s: could not create symbolic link "%s": %s
pl: %s: nie mo¿na utworzyæ linku symbolicznego "%s": %s

source: %s: symlinks are not supported on this platform
pl: %s: linki symb. nie s± obs³ugiwane na tej platformie

source: creating subdirectories ...
pl: tworzenie podkatalogów ...

source: Success. You can now start the database server using: %s%s%spostgres%s -D %s%s%s or %s%s%spg_ctl%s -D %s%s%s -l logfile start
pl: Sukces. Teraz mo¿esz uruchomiæ serwer bazy danych u¿ywaj±c: %s%s%spostgres%s -D %s%s%s lub %s%s%s%spg_ctl -D %s%s%s -l plik_z_logami start

source: out of memory
pl: brak pamiêci
ro: memorie insuficientã

source: could not set junction for "%s": %s
pl: nie mo¿na ustanowiæ z³±czenia dla "%s": %s

source: could not get junction for "%s": %s
pl: nie mo¿na pobraæ z³±czenia dla "%s": %s

source: could not open directory "%s": %s
pl: nie mo¿na otworzyæ katalogu "%s": %s

source: could not read directory "%s": %s
pl: nie mo¿na odczytaæ katalogu "%s": %s

source: could not stat file or directory "%s": %s
pl: nie mo¿na wykonaæ polecenia stat na pliku lub katalogu "%s": %s

source: could not remove file or directory "%s": %s
pl: nie mo¿na usun±æ pliku lub katalogu "%s": %s

source: could not identify current directory: %s
pl: nie mo¿na zidentyfikowaæ aktualnego katalogu: %s
ro: imposibil de identificat directorul curent: %s

source: invalid binary "%s"
pl: niepoprawny binarny "%s"
ro: binar incorect "%s"

source: could not read binary "%s"
pl: nie mo¿na odczytaæ binarnego "%s"
ro: imposibil de citit binar "%s"

source: could not find a "%s" to execute
pl: nie znaleziono "%s" do wykonania
ro: imposibil de gãsit "%s" pentru executare

source: could not change directory to "%s"
pl: nie mo¿na zmieniæ katalogu na "%s"
ro: imposibil de schimbat directorul în "%s"

source: could not read symbolic link "%s"
pl: nie mo¿na odczytaæ odwo³ania symbolicznego "%s"
ro: imposibil de citit legãtura simbolicã "%s"

source: child process exited with exit code %d
pl: proces potomny zakoñczyl dzia³anie z kodem %d
ro: procesul fiu a ieºit cu codul %d

source: child process was terminated by exception 0x%X
pl: proces potomny zosta³ zatrzymany przez wyj±tek 0x%X

source: child process was terminated by signal %s
pl: proces potomny zosta³ przerwany przez sygna³ %s

source: child process was terminated by signal %d
pl: proces potomny zosta³ przerwany przez sygna³ %d
ro: procesul fiu a fost terminat cu semnalul %d

source: child process exited with unrecognized status %d
pl: proces potomny zakoñczy³ dzia³anie z nieznanym stanem %d
ro: procesul fiu a ieºit cu starea nerecunoscutã %d

source: %s: warning: encoding mismatch
ro: %s: avertisment: nepotrivire de codificare

source: The encoding you selected (%s) and the encoding that the selected locale uses (%s) are not known to match. This may lead to misbehavior in various character string processing functions. To fix this situation, rerun %s and either do not specify an encoding explicitly, or choose a matching combination.
ro: Codificarea selectatã (%s) ºi codificarea folositã de localizarea selectatã (%s) nu se potrivesc. Acest lucru poate genera probleme în diverse funcþii de prelucrare a ºirurilor de caractere. Pentru a remedia situaþia, rulaþi %s din nou ºi fie nu specificaþi nici o codificare, fie selectaþi o combinaþie potrivitã.

source: %s: file "%s" does not exist This means you have a corrupted installation or identified the wrong directory with the invocation option -L.
ro: %s: fiºierul "%s" nu existã Acest lucru înseamnã cã aveþi o instalare coruptã sau cã aþi specificat un director greºit pentru opþiunea -L.

source: initializing pg_shadow ...
ro: iniþializare pg_shadow ...

source: %s: The password file was not generated. Please report this problem.
ro: %s: Fiºierul de parole nu a fost generat. Raportaþi aceastã problemã.

source: enabling unlimited row size for system tables ...
ro: activare dimensiune rând nelimitatã pentru tabelele sistem ...

source: initializing pg_depend ...
ro: iniþializare pg_depend ...

source: loading pg_description ...
ro: încãrcare pg_description ...

source: --locale=LOCALE initialize database cluster with given locale
ro: --locale=LOCALIZARE iniþializeazã grupul de baze de date cu localizarea datã

source: --lc-collate, --lc-ctype, --lc-messages=LOCALE --lc-monetary, --lc-numeric, --lc-time=LOCALE initialize database cluster with given locale in the respective category (default taken from environment)
ro: --lc-collate, --lc-ctype, --lc-messages=LOCALIZARE --lc-monetary, --lc-numeric, --lc-time=LOCALIZARE iniþializeazã grupul de baze de date cu localizarea datã în categoria respectivã (implicit, luatã din mediu)

source: --no-locale equivalent to --locale=C
ro: --no-locale echivalent cu --locale=C
