Repository: dvarrazzo/pgmessages
Catalog: */initdb.po
Languages: pl, ro

source: --pwfile=FILE read password for the new superuser from file
ro: --pwfile=FIªIER citire parolã pentru noul utilizator privilegiat din fiºier

source: %s: password prompt and password file may not be specified together
ro: %s: solicitarea parolei ºi fiºierul de parole nu pot fi specificate împreunã

source: %s: could not determine valid short version string
ro: %s: imposibil de determinat ºirul scurt de versiune corect

source: %s: could not find suitable encoding for locale "%s"
ro: %s: imposibil de gãsit o codificare potrivitã pentru localizarea "%s"

source: %s: directory "%s" exists but is not empty If you want to create a new database system, either remove or empty the directory "%s" or run %s with an argument other than "%s".
ro: %s: directorul "%s" existã, dar nu este gol Dacã doriþi sã creaþi un nou sistem de baze de date, eliminaþi sau goliþi directorul "%s" sau rulaþi %s cu alt argument decât "%s".

source: creating directory %s/%s ...
ro: creare director %s/%s ...

source: Success. You can now start the database server using: %s%s%s%spostmaster -D %s%s%s or %s%s%s%spg_ctl -D %s%s%s -l logfile start
ro: Succes. Acum puteþi porni serverul de baze de date folosind: %s%s%s%s/postmaster -D %s%s%s sau %s%s%s%s/pg_ctl -D %s%s%s -l fiºier_jurnal start
