Repository: dvarrazzo/pgmessages
Catalog: */pg_basebackup.po
Languages: ro

source: %s: out of memory
ro: %s: memorie insuficientă

source: %s takes a base backup of a running PostgreSQL server.
ro: %s face o copie de rezervă a bazei unui server PostgreSQL care rulează.

source: Usage:
ro: Utilizare:

source: %s [OPTION]...
ro: %s [OPŢIUNE]...

source: Options controlling the output:
ro: Opţiuni care controlează ieşirile:

source: -D, --pgdata=DIRECTORY receive base backup into directory
ro: -D, --pgdata=DIRECTOR salvează copia de rezervă a bazei in directorul

source: -F, --format=p|t output format (plain, tar)
ro: -F, --format=p|t formatul fişierului (p - text, t - arhivă de tip tar)

source: -x, --xlog include required WAL files in backup
ro: -x, --xlog include fişierele WAL necesare în copia de rezervă

source: -z, --gzip compress tar output
ro: -z, --gzip comprimă în format tar

source: -Z, --compress=0-9 compress tar output with given compression level
ro: -Z, --compress=0-9 comprimă în format tar cu specificarea nivelului de comprimare de la 0 la 9

source: General options:
ro: Opţiuni generale:

source: -c, --checkpoint=fast|spread set fast or spread checkpointing
ro: -c, --checkpoint=fast|spread stabileşte tipul de checkpoint fast(rapid) sau spread(distribuit)

source: -l, --label=LABEL set backup label
ro: -l, --label=ETICHETĂ stabileşte eticheta copiei de rezervă

source: -P, --progress show progress information
ro: -P, --progress arată informaţii despre progres

source: -v, --verbose output verbose messages
ro: -v, --verbose afişează mesaje

source: --help show this help, then exit
ro: --help afişează acest ajutor, apoi iese

source: --version output version information, then exit
ro: --version afişează informaţiile despre versiune, apoi iese

source: Connection options:
ro: Opţiuni de conectare:

source: -h, --host=HOSTNAME database server host or socket directory
ro: -h, --host=NUMEGAZDĂ gazda serverului de baze de date sau directorul soclului

source: -p, --port=PORT database server port number
ro: -p, --port=PORT numărul portului serverului de baze de date

source: -U, --username=NAME connect as specified database user
ro: -U, --username=NUME conectare ca utilizatorul de baze de date specificat

source: -w, --no-password never prompt for password
ro: -w, --no-password nu cere parolă

source: -W, --password force password prompt (should happen automatically)
ro: -W, --password forţează solicitarea parolei (în mod normal, se face automat)

source: Report bugs to <pgsql-bugs@postgresql.org>.
ro: Raportaţi erorile la <pgsql-bugs@postgresql.org>.

source: %s: could not create directory "%s": %s
ro: %s: imposibil de creat directorul "%s": %s

source: %s: directory "%s" exists but is not empty
ro: %s: directorul "%s" există dar nu este gol

source: %s: could not access directory "%s": %s
ro: %s: imposibil de accesat directorul "%s": %s

source: %s/%s kB (100%%), %d/%d tablespace %35s
ro: %s/%s kB (100%%), %d/%d spaţiutabelă %35s

source: %s/%s kB (%d%%), %d/%d tablespace (%-30.30s)
ro: %s/%s kB (%d%%), %d/%d spaţiutabelă (tablespace) (%-30.30s)

source: %s/%s kB (%d%%), %d/%d tablespace
ro: %s/%s kB (%d%%), %d/%d spaţiutabelă (tablespace)

source: %s: could not set compression level %i: %s
ro: %s: nu pot stabili nivelul de compresie %i: %s

source: %s: could not create compressed file "%s": %s
ro: %s: nu pot crea fişierul comprimat "%s": %s

source: %s: could not create file "%s": %s
ro: %s: nu pot crea fişierul "%s": %s

source: %s: could not get COPY data stream: %s
ro: %s: nu pot obţine COPY flux date: %s

source: %s: could not write to compressed file "%s": %s
ro: %s: nu pot scrie în fişierul comprimat "%s": %s

source: %s: could not write to file "%s": %s
ro: %s: nu pot scrie în fişierul "%s": %s

source: %s: could not read COPY data: %s
ro: %s: nu pot citi COPY date: %s

source: %s: could not parse file size
ro: %s: nu pot analiza dimensiunea fişierului

source: %s: could not parse file mode
ro: %s: nu pot analiza modul fişierului

source: %s: could not set permissions on directory "%s": %s
ro: %s: nu pot stabili drepturile de access pentru directorul "%s": %s

source: %s: could not create symbolic link from "%s" to "%s": %s
ro: %s: nu pot crea legătura simbolică de la "%s" la "%s": %s

source: %s: unrecognized link indicator "%c"
ro: %s: indicator al legaturii necunoscut "%c"

source: %s: could not set permissions on file "%s": %s
ro: %s: nu pot stabili drepturile de access pentru fişierul "%s": %s

source: %s: COPY stream ended before last file was finished
ro: %s: fluxul COPY s-a întrerupt înainte de terminarea ultimul fişier

source: Password:
ro: Parolă:

source: %s: could not connect to server: %s
ro: %s: nu pot realiza conexiunea la server: %s

source: %s: could not send base backup command: %s
ro: %s: nu pot trimite comanda de realizarea copiei de rezervă: %s

source: %s: could not initiate base backup: %s
ro: %s: nu pot iniţia copia de rezervă a bazei: %s

source: %s: no start point returned from server
ro: %s: serverul nu a returnat nici un punct de start

source: %s: could not get backup header: %s
ro: %s: nu pot obţine începutul de fişier al copiei de rezervă (backup header): %s

source: %s: no data returned from server
ro: %s: serverul nu a returnat date

source: %s: can only write single tablespace to stdout, database has %i
ro: %s: pot scrie doar un singur spaţiu tabelă (tablespace) la ieşirea standard (stdout), baza de date are %i

source: %s: could not get WAL end position from server
ro: %s: nu pot obţine de la server poziţia de sfârşit pentru WAL

source: %s: no WAL end position returned from server
ro: %s: serverul nu a returnat poziţia de sfârşit pentru WAL

source: %s: final receive failed: %s
ro: %s: recepţia finală a eşuat: %s

source: %s: invalid output format "%s", must be "plain" or "tar"
ro: %s: format de ieşire invalid "%s", trebuie să fiel "plain" sau "tar"

source: %s: invalid compression level "%s"
ro: %s: nivel de compresie invalid "%s"

source: %s: invalid checkpoint argument "%s", must be "fast" or "spread"
ro: %s: argument checkpoint invalid "%s", trebuie să fie "fast" sau "spread"

source: Try "%s --help" for more information.
ro: Încercaţi "%s --help" pentru mai multe informaţii.

source: %s: too many command-line arguments (first is "%s")
ro: %s: prea multe argumente în linia de comandă (primul este "%s")

source: %s: no target directory specified
ro: %s: directorul destinaţie nu este specificat

source: %s: only tar mode backups can be compressed
ro: %s: numai copiile de rezervă de tip tar pot fi comprimate

source: %s: this build does not support compression
ro: %s: această versiune de program nu suportă compresie
