Repository: dvarrazzo/pgmessages
Catalog: */pg_ctl.po
Languages: ro

source: %s: out of memory
ro: %s: memorie insuficientã

source: %s: could not open PID file "%s": %s
ro: %s: imposibil de deschis fiºierul PID "%s": %s

source: %s: another postmaster may be running; trying to start postmaster anyway
ro: %s: e posibil ca altã instanþã de postmaster sã ruleze; se încearcã pornirea lui oricum

source: %s: could not read file "%s"
ro: %s: imposibil de citit fiºierul "%s"

source: %s: option file "%s" must have exactly one line
ro: %s: fiºierul de opþiuni "%s" trebuie sã aibã exact o linie

source: The program "postmaster" is needed by %s but was not found in the same directory as "%s". Check your installation.
ro: Programul "postmaster" este necesar pentru %s, dar nu a fost gãsit în acelaºi director cu "%s". Verificaþi instalarea.

source: The program "postmaster" was found by "%s" but was not the same version as %s. Check your installation.
ro: Programul "postmaster" a fost gãsit de "%s", dar nu are aceeaºi versiune cu %s. Verificaþi instalarea.

source: %s: could not start postmaster: exit code was %d
ro: %s: imposibil de pornit postmaster: codul de ieºire a fost %d

source: %s: could not start postmaster Examine the log output.
ro: %s: imposibil de pornit postmaster Examinaþi jurnalul de ieºire.

source: waiting for postmaster to start...
ro: se aºteaptã ca postmaster sã porneascã...

source: could not start postmaster
ro: imposibil de pornit postmaster

source: done
ro: terminat

source: postmaster started
ro: postmaster pornit

source: postmaster starting
ro: postmaster porneºte

source: %s: PID file "%s" does not exist
ro: %s: fiºierul PID "%s" nu existã

source: Is postmaster running?
ro: Ruleazã postmaster?

source: %s: cannot stop postmaster; postgres is running (PID: %ld)
ro: %s: imposibil de oprit postmaster; postgres ruleazã (PID: %ld)

source: %s: could not send stop signal (PID: %ld): %s
ro: %s: imposibil de trimis semnalul de oprire (PID: %ld): %s

source: postmaster shutting down
ro: închidere postmaster

source: waiting for postmaster to shut down...
ro: închidere postmaster în aºteptare...

source: failed
ro: eºuat

source: %s: postmaster does not shut down
ro: %s: postmaster nu se închide

source: postmaster stopped
ro: postmaster oprit

source: starting postmaster anyway
ro: pornire postmaster oricum

source: %s: cannot restart postmaster; postgres is running (PID: %ld)
ro: %s: imposibil de repornit postmaster; postgres ruleazã (PID: %ld)

source: Please terminate postgres and try again.
ro: Terminaþi postgres ºi încercaþi din nou.

source: %s: cannot reload postmaster; postgres is running (PID: %ld)
ro: %s: imposibil de reîncãrcat postmaster; postgres ruleazã (PID: %ld)

source: %s: could not send reload signal (PID: %ld): %s
ro: %s: imposibil de trimis semnalul de reîncãrcare (PID: %ld): %s

source: postmaster signaled
ro: semnalul a fost trimis lui postmaster

source: %s: neither postmaster nor postgres running
ro: %s: nu ruleazã nici postmaster, nici postgres

source: %s: a standalone backend "postgres" is running (PID: %ld)
ro: %s: ruleazã un proces "postgres" de sine stãtãtor (PID: %ld)

source: %s: postmaster is running (PID: %ld)
ro: %s: postmaster ruleazã (PID: %ld)

source: %s: could not send signal %d (PID: %ld): %s
ro: %s: imposibil de trimis semnalul %d (PID: %ld): %s

source: %s: could not find own program executable
ro: %s: imposibil de gãsit propriul program executabil

source: %s: could not find postmaster program executable
ro: %s: imposibil de gãsit programul executabil pentru postmaster

source: %s: could not open service manager
ro: %s: imposibil de deschis administratorul de servicii

source: %s: service "%s" already registered
ro: %s: serviciul "%s" este deja înregistrat

source: %s: could not register service "%s": error code %d
ro: %s: imposibil de înregistrat serviciul "%s": cod de eroare %d

source: %s: service "%s" not registered
ro: %s: serviciul "%s" nu a fost înregistrat

source: %s: could not open service "%s": error code %d
ro: %s: imposibil de deschis serviciul "%s": cod de eroare %d

source: %s: could not unregister service "%s": error code %d
ro: %s: imposibil de de-înregistrat serviciul "%s": cod de eroare %d

source: %s: could not start service "%s": error code %d
ro: %s: imposibil de pornit serviciul "%s": cod de eroare %d

source: Try "%s --help" for more information.
ro: Încercaþi "%s --help" pentru mai multe informaþii.

source: %s is a utility to start, stop, restart, reload configuration files, report the status of a PostgreSQL server, or signal a PostgreSQL process.
ro: %s este un utilitar pentru pornit, oprit, repornit, reîncãrcat fiºierele de configurare, raportat starea unui server PostgreSQL sau trimis semnale unui proces PostgreSQL.

source: Usage:
ro: Utilizare:

source: %s start [-w] [-D DATADIR] [-s] [-l FILENAME] [-o "OPTIONS"]
ro: %s start [-w] [-D DIRDATE] [-s] [-l NUMEFIªIER] [-o "OPÞIUNI"]

source: %s stop [-W] [-D DATADIR] [-s] [-m SHUTDOWN-MODE]
ro: %s stop [-W] [-D DIRDATE] [-s] [-m MOD-ÎNCHIDERE]

source: %s restart [-w] [-D DATADIR] [-s] [-m SHUTDOWN-MODE] [-o "OPTIONS"]
ro: %s restart [-w] [-D DIRDATE] [-s] [-m MOD-ÎNCHIDERE] [-o "OPÞIUNI"]

source: %s reload [-D DATADIR] [-s]
ro: %s reload [-D DIRDATE] [-s]

source: %s status [-D DATADIR]
ro: %s status [-D DIRDATE]

source: %s kill SIGNALNAME PID
ro: %s kill NUMESEMNAL PID

source: %s register [-N SERVICENAME] [-U USERNAME] [-P PASSWORD] [-D DATADIR] [-w] [-o "OPTIONS"]
ro: %s register [-N NUMESERVICIU] [-U NUMEUTILIZATOR] [-P PAROLÃ] [-D DIRDATE] [-w] [-o "OPÞIUNI"]

source: %s unregister [-N SERVICENAME]
ro: %s unregister [-N NUMESERVICIU]

source: Common options:
ro: Opþiuni generale:

source: -D, --pgdata DATADIR location of the database storage area
ro: -D, --pgdata DIRDATE locaþia ariei de stocare a bazelor de date

source: -s, --silent only print errors, no informational messages
ro: -s, --silent afiºeazã numai erorile, fãrã mesaje informaþionale

source: -w wait until operation completes
ro: -w se aºteaptã terminarea operaþiunilor

source: -W do not wait until operation completes
ro: -W nu se aºteaptã terminarea operaþiunilor

source: --help show this help, then exit
ro: --help afiºeazã acest ajutor, apoi iese

source: --version output version information, then exit
ro: --version afiºeazã informaþii despre versiune, apoi iese

source: (The default is to wait for shutdown, but not for start or restart.)
ro: (Implicit, se aºteaptã pentru închidere, nu ºi pentru pornire sau repornire)

source: If the -D option is omitted, the environment variable PGDATA is used.
ro: Dacã este omisã opþiunea -D, este folositã variabila de mediu PGDATA.

source: Options for start or restart:
ro: Opþiuni pentru pornire sau repornire:

source: -l, --log FILENAME write (or append) server log to FILENAME
ro: -l, --log NUMEFIªIER scrie (sau adaugã) jurnalul serverului în NUMEFIªIER

source: -o OPTIONS command line options to pass to the postmaster (PostgreSQL server executable)
ro: -o OPÞIUNI opþiuni din linia de comandã trimise cãtre postmaster (fiºierul executabil pentru serverul PostgreSQL)

source: -p PATH-TO-POSTMASTER normally not necessary
ro: -p CALE-CÃTRE-POSTMASTER în mod normal, nu e necesarã

source: Options for stop or restart:
ro: Opþiuni pentru oprire sau repornire:

source: -m SHUTDOWN-MODE may be "smart", "fast", or "immediate"
ro: -m MOD-ÎNCHIDERE poate fi "smart", "fast", sau "immediate"

source: Shutdown modes are:
ro: Modurile de închidere sunt:

source: smart quit after all clients have disconnected
ro: smart (isteþ) terminã dupã ce toþi clienþii s-au deconectat

source: fast quit directly, with proper shutdown
ro: fast (rapid) terminã direct, cu închidere corespunzãtoare

source: immediate quit without complete shutdown; will lead to recovery on restart
ro: immediate (imediat) terminã fãra închidere completã, ceea ce va duce la recuperare odatã cu repornirea

source: Allowed signal names for kill:
ro: Semnale permise pentru kill:

source: Options for register and unregister:
ro: Opþiuni pentru înregistrare ºi de-înregistrare:

source: -N SERVICENAME service name with which to register PostgreSQL server
ro: -N NUMESERVICIU numele serviciului pentru înregistrarea serverului PostgreSQL

source: -P PASSWORD password of account to register PostgreSQL server
ro: -P PAROLÃ parola contului pentru înregistrarea serverului PostgreSQL

source: -U USERNAME user name of account to register PostgreSQL server
ro: -U NUMEUTILIZATOR numele utilizatorului pentru înregistrarea serverului PostgreSQL

source: Report bugs to <pgsql-bugs@postgresql.org>.
ro: Raportaþi erorile la <pgsql-bugs@postgresql.org>.

source: %s: unrecognized shutdown mode "%s"
ro: %s: mod de închidere nerecunoscut "%s"

source: %s: unrecognized signal name "%s"
ro: %s: nume de semnal nerecunoscut "%s"

source: %s: cannot be run as root Please log in (using, e.g., "su") as the (unprivileged) user that will own the server process.
ro: %s: nu poate fi rulat ca root Autentificaþi-vã (folosind, de ex., "su") ca utilizatorul (neprivilegiat) care va deþine procesul serverului.

source: %s: invalid option %s
ro: %s: opþiune incorectã %s

source: %s: too many command-line arguments (first is "%s")
ro: %s: prea multe argumente în linia de comandã (primul este "%s")

source: %s: missing arguments for kill mode
ro: %s: lipseºte argumentul pentru modul kill

source: %s: unrecognized operation mode "%s"
ro: %s: mod de operare nerecunoscut "%s"

source: %s: no operation specified
ro: %s: nici o operaþiune specificatã

source: %s: no database directory specified and environment variable PGDATA unset
ro: %s: nici un director pentru baze de date specificat, iar variabila de mediu PGDATA nu este setatã

source: could not identify current directory: %s
ro: imposibil de identificat directorul curent: %s

source: invalid binary "%s"
ro: binar incorect "%s"

source: could not read binary "%s"
ro: imposibil de citit binar "%s"

source: could not find a "%s" to execute
ro: imposibil de gãsit "%s" pentru executare

source: could not change directory to "%s"
ro: imposibil de schimbat directorul în "%s"

source: could not read symbolic link "%s"
ro: imposibil de citit legãtura simbolicã "%s"

source: child process exited with exit code %d
ro: procesul fiu a ieºit cu codul %d

source: child process was terminated by signal %d
ro: procesul fiu a fost terminat cu semnalul %d

source: child process exited with unrecognized status %d
ro: procesul fiu a ieºit cu starea nerecunoscutã %d
