Repository: dvarrazzo/pgmessages
Catalog: */pg_dump.po
Languages: ro

source: WARNING: ftell mismatch with expected position -- ftell used
ro: AVERTISMENT: nepotrivire ftell cu poziþia aºteptatã -- folosit ftell

source: could not compress data: %s
ro: imposibil de comprimat datele: %s

source: could not write compressed chunk
ro: imposibil de scris fragmentul comprimat

source: could not write uncompressed chunk
ro: imposibil de scris fragmentul necomprimat

source: could not close compression stream: %s
ro: imposibil de închis fluxul comprimat: %s

source: archiver (db)
ro: arhivator (bd)

source: could not get server_version from libpq
ro: imposibil de preluat server_version din libpq

source: server version: %s; %s version: %s
ro: versiune server: %s, %s versiune: %s

source: proceeding despite version mismatch
ro: continuare în ciuda diferenþei de versiune

source: aborting because of version mismatch (Use the -i option to proceed anyway.)
ro: abandonare din cauza nepotrivirii de versiune (Folosiþi optiunea -i pentru a continua oricum.)

source: connecting to database "%s" as user "%s"
ro: conectare la baza de date "%s" ca utilizator "%s"

source: Password:
ro: Parolã:

source: failed to reconnect to database
ro: reconectare la baza de date eºuatã

source: could not reconnect to database: %s
ro: imposibil de reconectat la baza de date: %s

source: already connected to a database
ro: deja conectat la baza de date

source: failed to connect to database
ro: conectare la baza de date eºuatã

source: connection to database "%s" failed: %s
ro: conectare la baza de date "%s" eºuatã: %s

source: %s: no result from server
ro: %s: nici un rezultat de la server

source: COPY command executed in non-primary connection
ro: comanda COPY executatã în conexiune ne-primarã

source: error returned by PQputline
ro: eroare returnatã de PQputline

source: error returned by PQendcopy
ro: eroare returnatã de PQendcopy

source: could not execute query
ro: imposibil de executat interogarea

source: could not find OID columns of table "%s": %s
ro: imposibil de gãsit coloanele OID pentru tabela "%s": %s

source: no OID type columns in table %s
ro: nici o coloanã de tip OID în tabela %s

source: fixing large object cross-references for %s.%s
ro: stabilire referinþe încruciºate ale obiectelor mari pentru %s.%s

source: could not update column "%s" of table "%s": %s
ro: imposibil de actualizat coloana "%s" din tabela "%s": %s

source: error while updating column "%s" of table "%s": %s
ro: eroare la actualizarea coloanei "%s" din tabela "%s": %s

source: creating table for large object cross-references
ro: creare tabelã pentru referinþele încruciºate ale obiectelor mari

source: could not create large object cross-reference table
ro: imposibil de creat tabela pentru referinþele încruciºate ale obiectelor mari

source: creating index for large object cross-references
ro: creare index pentru referinþele încruciºate ale obiectelor mari

source: could not create index on large object cross-reference table
ro: imposibil de creat indexul pentru referinþele încruciºate ale obiectelor mari

source: could not create large object cross-reference entry
ro: imposibil de creat intrarea pentru referinþele încruciºate ale obiectelor mari

source: could not start database transaction
ro: imposibil de pornit tranzacþia de bazã de date

source: could not start transaction for large object cross-references
ro: imposibil de pornit tranzacþia pentru referinþele încruciºate ale obiectelor mari

source: could not commit database transaction
ro: imposibil de finalizat tranzacþia de bazã de date

source: could not commit transaction for large object cross-references
ro: imposibil de finalizat tranzacþia pentru referinþele încruciºate ale obiectelor mari

source: file archiver
ro: arhivator de fiºiere

source: WARNING: This format is for demonstration purposes; it is not intended for normal use. Files will be written in the current working directory.
ro: AVERTISMENT: Acest format are scop demonstrativ; nu este destinat folosirii în mod normal. Fiºierele vor fi scrise în directorul de lucru curent.

source: could not open data file for output
ro: imposibil de deschis fiºierul pentru ieºire

source: could not close data file
ro: imposibil de închis fiºierul de date

source: could not open data file for input
ro: imposibil de deschis fiºierul pentru intrare

source: could not close data file after reading
ro: imposibil de închis fiºierul de date dupã citire

source: could not open large object TOC for input: %s
ro: imposibil de deschis cuprinsul obiectelor mari pentru citire: %s

source: could not close large object TOC file: %s
ro: imposibil de închis fiºierul cuprins pentru obiecte mari: %s

source: could not write byte
ro: imposibil de scris octetul

source: could not open large object TOC for output: %s
ro: imposibil de deschis cuprinsul obiectelor mari pentru scriere: %s

source: invalid OID for large object (%u)
ro: OID incorect pentru obiectul mare (%u)

source: could not open large object file
ro: imposibil de deschis fiºierul obiect mare

source: could not close large object file
ro: imposibil de închis fiºierul obiect mare

source: this format cannot be read
ro: acest format nu poate fi citit

source: tar archiver
ro: arhivator tar

source: could not open TOC file for output: %s
ro: imposibil de deschis fiºierul cuprins pentru ieºire: %s

source: compression not supported by tar output format
ro: compresia nu este suportatã de formatul de ieºire tar

source: could not open TOC file for input: %s
ro: imposibil de deschis fiºierul cuprins pentru intrare: %s

source: could not find file %s in archive
ro: imposibil de gãsit fiºierul %s în arhivã

source: compression support is disabled in this format
ro: suportul pentru compresie este dezactivat pentru acest format

source: could not generate temporary file name: %s
ro: imposibil de generat numele de fiºier temporar: %s

source: could not open temporary file
ro: imposibil de deschis fiºierul temporar

source: could not close tar member
ro: imposibil de închis membrul tar

source: internal error -- neither th nor fh specified in tarReadRaw()
ro: eroare internã --nu a fost specificat nici th, nici fh în ReadRaw()

source: requested %d bytes, got %d from lookahead and %d from file
ro: %d octeþi solicitaþi, %d obþinuþi din lookahead ºi %d din fiºier

source: could not write to tar member (wrote %lu, attempted %lu)
ro: imposibil de scris în membrul tar (%lu scriºi, %lu încercaþi)

source: invalid COPY statement -- could not find "copy" in string "%s"
ro: instrucþiune COPY incorectã -- imposibil de gãsit "copy" în ºirul "%s"

source: invalid COPY statement -- could not find "from stdin" in string "%s" starting at position %lu
ro: instrucþiune COPY incorectã -- imposibil de gãsit "from stdin" în ºirul "%s" începând la poziþia %lu

source: restoring large object OID %u
ro: restabilire OID obiect mare %u

source: could not write null block at end of tar archive
ro: imposibil de scris blocul nul la sfârºitul arhivei tar

source: archive member too large for tar format
ro: membrul arhivei este prea mare pentru formatul tar

source: write error appending to tar archive (wrote %lu, attempted %lu)
ro: eroare de scriere la adãugarea în arhiva tar (%lu scris, %lu încercat)

source: could not close tar member: %s
ro: imposibil de închis membrul tar: %s

source: actual file length (%s) does not match expected (%s)
ro: lungimea realã a fiºierului (%s) nu se potriveºte cu cea aºteptatã (%s)

source: could not output padding at end of tar member
ro: imposibil de completat la sfârºitul membrului tar

source: moving from position %s to next member at file position %s
ro: mutare de la poziþia %s la urmãtorul membru, la pozitia din fiºier %s

source: now at file position %s
ro: acum la poziþia din fiºier %s

source: could not find header for file %s in tar archive
ro: imposibil de gãsit antetul pentru fiºierul %s în arhiva tar

source: skipping tar member %s
ro: ignorare membru tar %s

source: dumping data out of order is not supported in this archive format: %s is required, but comes before %s in the archive file.
ro: descãrcarea datelor defecte nu este suportatã în acest format de arhivã: este necesar %s, dar apare înainte de %s în fiºierul arhivã.

source: mismatch in actual vs. predicted file position (%s vs. %s)
ro: nepotrivire între poziþia realã ºi cea prezisã (%s ºi %s)

source: incomplete tar header found (%lu bytes)
ro: antet tar incomplet (%lu octeþi)

source: TOC Entry %s at %s (length %lu, checksum %d)
ro: Intrare în cuprins %s la %s (lungime %lu, sumã de control %d)

source: corrupt tar header found in %s (expected %d, computed %d) file position %s
ro: antet tar corupt gãsit în %s (%d aºteptat, %d calculat) la poziþia din fiºier %s

source: could not write tar header
ro: imposibil de scris antetul tar

source: %s: cannot specify both -d and -f output
ro: %s: -d ºi -f ieºire nu pot fi specificate împreunã

source: WARNING: errors ignored on restore: %d
ro: AVERTISMENT: erori ignorate la restabilire: %d

source: %s restores a PostgreSQL database from an archive created by pg_dump.
ro: %s restabileºte o bazã de date PostgreSQL dintr-o arhivã creatã de pg_dump.

source: %s [OPTION]... [FILE]
ro: %s [OPÞIUNE]... [FIªIER]

source: -d, --dbname=NAME connect to database name
ro: -d, --dbname=NUME conectare la baza de date NUME

source: -F, --format=c|t specify backup file format
ro: -F, --format=c|t specificã formatul fiºierului de rezervã

source: -i, --ignore-version proceed even when server version mismatches
ro: -i, --ignore-version continuã chiar dacã versiunea serverului nu se potriveºte

source: -l, --list print summarized TOC of the archive
ro: -l, --list afiºeazã cuprinsul sumar al arhivei

source: Options controlling the restore:
ro: Opþiuni care controleazã restabilirea:

source: -a, --data-only restore only the data, no schema
ro: -a, --data-only restabileºte doar datele, fãrã schemã

source: -C, --create create the target database
ro: -C, --create creeazã baza de date destinaþie

source: -I, --index=NAME restore named index
ro: -I, --index=NUME restabileºte indexul precizat

source: -L, --use-list=FILENAME use specified table of contents for ordering output from this file
ro: -L, --use-list=NUMEFIªIER foloseºte cuprinsul specificat pentru ordonarea ieºirii din acest fiºier

source: -O, --no-owner skip restoration of object ownership
ro: -O, --no-owner nu se restabileºte proprietarul obiectului

source: -P, --function=NAME(args) restore named function
ro: -P, --function=NUME(argumente) restabileºte funcþia precizatã

source: -s, --schema-only restore only the schema, no data
ro: -s, --schema-only restabileºte numai schema, fãrã date

source: -S, --superuser=NAME specify the superuser user name to use for disabling triggers
ro: -S, --superuser=NUME specificã numele utilizatorului privilegiat folosit pentru dezactivarea declanºatorilor

source: -t, --table=NAME restore named table
ro: -t, --table=NAME restabileºte tabela precizatã

source: -T, --trigger=NAME restore named trigger
ro: -T, --trigger=NAME restabileºte declanºatorul precizat

source: -x, --no-privileges skip restoration of access privileges (grant/revoke)
ro: -x, --no-privileges se ignorã restabilirea drepturilor de acces (acordare/revocare)

source: -e, --exit-on-error exit on error, default is to continue
ro: -e, --exit-on-error ieºire în caz de eroare, implicit se continuã

source: If no input file name is supplied, then standard input is used.
ro: Dacã nu este specificat un fiºier de intrare, este folositã intrarea standard.

source: The program "pg_dump" is needed by %s but was not found in the same directory as "%s". Check your installation.
ro: Programul "pg_dump" este necesar pentru %s dar nu a fost gãsit în acelaºi director cu "%s". Verificaþi instalarea.

source: The program "pg_dump" was found by "%s" but was not the same version as %s. Check your installation.
ro: Programul "pg_dump" a fost gãsit de "%s" dar nu are aceeaºi versiune cu %s. Verificaþi instalarea.

source: %s extracts a PostgreSQL database cluster into an SQL script file.
ro: %s extrage un grup de baze de date PostgreSQL într-un fiºier SQL.

source: %s [OPTION]...
ro: %s [OPÞIUNE]...

source: -i, --ignore-version proceed even when server version mismatches pg_dumpall version
ro: -i, --ignore-version continuã chiar dacã versiunea serverului nu se potriveºte cu versiunea pg_dumpall

source: -c, --clean clean (drop) databases prior to create
ro: -c, --clean curãþã (ºterge) baza de date înainte de creare

source: -g, --globals-only dump only global objects, no databases
ro: -g, --globals-only descarcã doar obiectele globale, fãrã baze de date

source: -S, --superuser=NAME specify the superuser user name to use in the dump
ro: -S, --superuser=NUME specificã numele utilizatorului privilegiat folosit în aceastã descãrcare

source: The SQL script will be written to the standard output.
ro: Scriptul SQL va fi scris la ieºirea standard.

source: %s: could not parse ACL list (%s) for tablespace "%s"
ro: %s: imposibil de analizat lista de control al accesului (%s) pentru spaþiul de tabele "%s"

source: %s: could not parse ACL list (%s) for database "%s"
ro: %s: imposibil de analizat lista de control al accesului (%s) pentru baza de date "%s"

source: %s: dumping database "%s"...
ro: %s: descãrcare bazã de date "%s"...

source: %s: pg_dump failed on database "%s", exiting
ro: %s: pg_dump a eºuat pentru baza de date "%s", ieºire

source: %s: running "%s"
ro: %s: rulare "%s"

source: %s: could not connect to database "%s"
ro: %s: imposibil de conectat la baza de date "%s"

source: %s: could not connect to database "%s": %s
ro: %s: imposibil de conectat la baza de date "%s": %s

source: %s: could not get server version
ro: %s: imposibil de obþinut versiunea serverului

source: %s: could not parse server version "%s"
ro: %s: imposibil de analizat versiunea serverului "%s"

source: %s: executing %s
ro: %s: executare %s

source: %s: query failed: %s
ro: %s: interogare eºuatã: %s

source: %s: query was: %s
ro: %s: interogarea era: %s

source: could not identify current directory: %s
ro: imposibil de identificat directorul curent: %s

source: invalid binary "%s"
ro: binar incorect "%s"

source: could not read binary "%s"
ro: imposibil de citit binar "%s"

source: could not find a "%s" to execute
ro: imposibil de gãsit "%s" pentru executare

source: could not change directory to "%s"
ro: imposibil de schimbat directorul în "%s"

source: could not read symbolic link "%s"
ro: imposibil de citit legãtura simbolicã "%s"

source: child process exited with exit code %d
ro: procesul fiu a ieºit cu codul %d

source: child process was terminated by signal %d
ro: procesul fiu a fost terminat cu semnalul %d

source: child process exited with unrecognized status %d
ro: procesul fiu a ieºit cu starea nerecunoscutã %d
