Repository: dvarrazzo/pgmessages
Catalog: */pg_dump.po
Languages: ro

source: User name:
ro: Nume utilizator:

source: %s: invalid -X option -- %s
ro: %s: opþiune -X incorectã -- %s

source: Try "%s --help" for more information.
ro: Încercaþi "%s --help" pentru mai multe informaþii.

source: %s: too many command-line arguments (first is "%s")
ro: %s: prea multe argumente în linia de comandã (primul este "%s")

source: options "schema only" (-s) and "data only" (-a) cannot be used together
ro: opþiunile "doar schema" (-s) ºi " doar date" (-a) nu pot fi folosite împreunã

source: options "clean" (-c) and "data only" (-a) cannot be used together
ro: opþiunile "curãþare" (-c) ºi "doar date" (-a) nu pot fi folosite împreunã

source: large-object output not supported for a single table
ro: ieºirea pentru obiecte mari nu este suportatã pentru o singurã tabelã

source: use a full dump instead
ro: folosiþi în schimb o descãrcare completã

source: large-object output not supported for a single schema
ro: ieºirea pentru obiecte mari nu este suportatã pentru o singurã schemã

source: INSERT (-d, -D) and OID (-o) options cannot be used together
ro: opþiunile INSERT (-d, -D) ºi OID (-o) nu pot fi folosite împreunã

source: (The INSERT command cannot set OIDs.)
ro: (comanda INSERT nu poate seta OID-uri)

source: large-object output is not supported for plain-text dump files
ro: ieºirea pentru obiecte mari nu este suportatã pentru descãrcarea în fiºiere text simplu

source: (Use a different output format.)
ro: (Folosiþi un alt format de ieºire)

source: invalid output format "%s" specified
ro: format de ieºire specificat "%s" incorect

source: could not open output file "%s" for writing
ro: imposibil de deschis pentru scriere fiºierul de ieºire "%s"

source: could not parse version string "%s"
ro: imposibil de analizat ºirul de versiune "%s"

source: last built-in OID is %u
ro: ultimul OID intern este %u

source: %s dumps a database as a text file or to other formats.
ro: %s descarcã o bazã de date într-un fiºier text sau alt format.

source: Usage:
ro: Utilizare:

source: %s [OPTION]... [DBNAME]
ro: %s [OPÞIUNE]... [NUMEDB]

source: General options:
ro: Opþiuni generale:

source: -f, --file=FILENAME output file name
ro: -f, --file=NUMEFIªIER nume fiºier de ieºire

source: -F, --format=c|t|p output file format (custom, tar, plain text)
ro: -F, --format=c|t|p format fiºier de ieºire (c: particular, t: tar, p: text simplu)

source: -i, --ignore-version proceed even when server version mismatches pg_dump version
ro: -i, --ignore-version continuã chiar dacã versiunea serverului nu se potriveºte cu cea a pg_dump

source: -v, --verbose verbose mode
ro: -v, --verbose mod detaliat

source: -Z, --compress=0-9 compression level for compressed formats
ro: -Z, --compress=0-9 nivel de compresie pentru formatele comprimate

source: --help show this help, then exit
ro: --help afiºeazã acest ajutor, apoi iese

source: --version output version information, then exit
ro: --version afiºeazã informaþiile despre versiune, apoi iese

source: Options controlling the output content:
ro: Opþiuni care controleazã conþinutul ieºirii:

source: -a, --data-only dump only the data, not the schema
ro: -a, --data-only descarcã numai datele, fãrã schemã

source: -b, --blobs include large objects in dump
ro: -b, --blobs include obiectele mari în descãrcare

source: -c, --clean clean (drop) schema prior to create
ro: -c, --clean curãþã (ºterge) schema înainte de creare

source: -C, --create include commands to create database in dump
ro: -C, --create include în descãrcare comenzi pentru crearea bazei de date

source: -d, --inserts dump data as INSERT, rather than COPY, commands
ro: -d, --inserts descarcã datele sub formã de comenzi INSERT, nu COPY

source: -D, --column-inserts dump data as INSERT commands with column names
ro: -D, --column-inserts descarcã datele sub formã de comenzi INSERT cu nume de coloane

source: -n, --schema=SCHEMA dump the named schema only
ro: -n, --schema=SCHEMÃ descarcã doar schema precizatã

source: -o, --oids include OIDs in dump
ro: -o, --oids include OID-uri în descãrcare

source: -O, --no-owner skip restoration of object ownership in plain text format
ro: -O, --no-owner nu se restabileºte proprietarul obiectelor în formatul text simplu

source: -s, --schema-only dump only the schema, no data
ro: -s, --schema-only descarcã doar schema, fãrã date

source: -S, --superuser=NAME specify the superuser user name to use in plain text format
ro: -S, --superuser=NUME specificã numele utilizatorului privilegiat folosit pentru formatul text simplu

source: -t, --table=TABLE dump the named table only
ro: -t, --table=TABELÃ descarcã doar tabela precizatã

source: -x, --no-privileges do not dump privileges (grant/revoke)
ro: -x, --no-privileges nu se descarcã privilegiile (acordare/revocare)

source: -X disable-dollar-quoting, --disable-dollar-quoting disable dollar quoting, use SQL standard quoting
ro: -X disable-dollar-quoting, --disable-dollar-quoting dezactiveazã citarea cu dolar, se foloseºte citarea standard SQL

source: -X disable-triggers, --disable-triggers disable triggers during data-only restore
ro: -X disable-triggers, --disable-triggers dezactiveazã declanºatorii în timpul restabilirii doar a datelor

source: -X use-set-session-authorization, --use-set-session-authorization use SESSION AUTHORIZATION commands instead of OWNER TO commands
ro: -X use-set-session-authorization, --use-set-session-authorization foloseºte comenzile SESSION AUTHORIZATION în locul celor OWNER TO

source: Connection options:
ro: Opþiuni de conectare:

source: -h, --host=HOSTNAME database server host or socket directory
ro: -h NUMEGAZDÃ gazda serverului de baze de date sau directorul soclului

source: -p, --port=PORT database server port number
ro: -p, --port=PORT numãrul portului serverului de baze de date

source: -U, --username=NAME connect as specified database user
ro: -U, --username=NUME conectare ca utilizatorul de baze de date specificat

source: -W, --password force password prompt (should happen automatically)
ro: -W, --password forþeazã solicitarea parolei (în mod normal, se face automat)

source: If no database name is supplied, then the PGDATABASE environment variable value is used.
ro: Dacã nu este specificat numele bazei de date, este folositã variabila de mediu PGDATABASE.

source: Report bugs to <pgsql-bugs@postgresql.org>.
ro: Raportaþi erorile la <pgsql-bugs@postgresql.org>.

source: *** aborted because of error
ro: *** abandon ca urmare a unei erori

source: dumping contents of table %s
ro: descãrcare conþinut tabelã %s

source: SQL command to dump the contents of table "%s" failed: PQendcopy() failed.
ro: Comanda SQL pentru descãrcarea conþinutului tabelei"%s" a eºuat: PQendcopy() a eºuat.

source: Error message from server: %s
ro: Mesaj de eroare de la server: %s

source: The command was: %s
ro: Comanda era: %s

source: saving database definition
ro: salvare definiþie bazã de date

source: missing pg_database entry for database "%s"
ro: lipseºte intrarea pg_database pentru baza de date "%s"

source: query returned more than one (%d) pg_database entry for database "%s"
ro: interogarea a returnat mai multe intrãri pg_database (%d) pentru baza de date "%s"

source: saving encoding
ro: salvare codificare

source: saving large objects
ro: salvare obiecte mari

source: dumpBlobs(): could not open large object: %s
ro: dumpBlobs(): imposibil de deschis obiectul mare: %s

source: dumpBlobs(): error reading large object: %s
ro: dumpBlobs(): eroare la citirea obiectului mare: %s

source: WARNING: owner of schema "%s" appears to be invalid
ro: AVERTISMENT: proprietarul schemei "%s" pare sã fie incorect

source: specified schema "%s" does not exist
ro: schema specificatã "%s" nu existã

source: schema with OID %u does not exist
ro: schema cu OID %u nu existã

source: WARNING: owner of data type "%s" appears to be invalid
ro: AVERTISMENT: proprietarul tipului de date "%s" pare sã fie incorect

source: WARNING: owner of operator "%s" appears to be invalid
ro: AVERTISMENT: proprietarul operatorului "%s" pare sã fie incorect

source: WARNING: owner of operator class "%s" appears to be invalid
ro: AVERTISMENT: proprietarul clasei de operatori "%s" pare sã fie incorect

source: WARNING: owner of aggregate function "%s" appears to be invalid
ro: AVERTISMENT: proprietarul funcþiei de agregare "%s" pare sã fie incorect

source: WARNING: owner of function "%s" appears to be invalid
ro: AVERTISMENT: proprietarul funcþiei "%s" pare sã fie incorect

source: WARNING: owner of table "%s" appears to be invalid
ro: AVERTISMENT: proprietarul tabelei "%s" pare sã fie incorect

source: specified table "%s" does not exist
ro: tabela specificatã "%s" nu existã

source: reading indexes for table "%s"
ro: citire indexuri pentru tabela "%s"

source: reading foreign key constraints for table "%s"
ro: citire restricþii de cheie strãinã pentru tabela "%s"

source: reading triggers for table "%s"
ro: citire declanºatori pentru tabela "%s"

source: expected %d triggers on table "%s" but found %d
ro: %d declanºatori aºteptaþi pentru tabela "%s", %d gãsiþi

source: query produced null referenced table name for foreign key trigger "%s" on table "%s" (OID of table: %u)
ro: interogarea a returnat un nume de tabelã referinþã nulã pentru declanºatorul de cheie strãinã "%s" pentru tabela "%s" (OID tabelã: %u)

source: finding the columns and types of table "%s"
ro: gãsire coloane ºi tipuri pentru tabela "%s"

source: invalid column numbering in table "%s"
ro: numerotarea coloanelor incorectã în tabela "%s"

source: finding default expressions of table "%s"
ro: gãsire expresii implicite pentru tabela "%s"

source: invalid adnum value %d for table "%s"
ro: valoare adnum incorectã (%d) pentru tabela "%s"

source: finding check constraints for table "%s"
ro: gãsire verificãri de restricþii pentru tabela "%s"

source: expected %d check constraints on table "%s" but found %d
ro: %d verificãri de restricþii aºteptate pentru tabela "%s", %d gãsite

source: (The system catalogs might be corrupted.)
ro: (Cataloagele sistem ar putea fi corupte)

source: Got %d rows instead of one from: %s
ro: %d rânduri (în loc de unul) primite de la: %s

source: query yielded no rows: %s
ro: interogarea nu a furnizat nici un rând: %s

source: WARNING: could not parse proargnames array
ro: AVERTISMENT: imposibil de analizat vectorul proargnames

source: unrecognized provolatile value for function "%s"
ro: valoare provolatile nerecunoscutã pentru funcþia "%s"

source: WARNING: could not find operator with OID %s
ro: AVERTISMENT: imposibil de gãsit operatorul cu OID %s

source: WARNING: aggregate function %s could not be dumped correctly for this database version; ignored
ro: AVERTISMENT: funcþia de agregare %s nu a putut fi descãrcatã corect pentru aceastã versiune de bazã de date; se ignorã

source: could not parse ACL list (%s) for object "%s" (%s)
ro: imposibil de analizat lista de control al accesului (%s) pentru obiectul "%s" (%s)

source: query to obtain definition of view "%s" returned no data
ro: interogarea pentru obþinerea definiþiei vizualizãrii "%s" nu a returnat nimic

source: query to obtain definition of view "%s" returned more than one definition
ro: interogarea pentru obþinerea definiþiei vizualizãrii "%s" a returnat mai multe rezultate

source: definition of view "%s" appears to be empty (length zero)
ro: definiþia vizualizãrii "%s" pare sã fie goalã (lungime zero)

source: invalid column number %d for table "%s"
ro: numãr de coloane incorect (%d) pentru tabela "%s"

source: missing index for constraint "%s"
ro: lipseºte indexul pentru restricþia "%s"

source: unrecognized constraint type: %c
ro: tip de restricþie nerecunoscut: %c

source: inserted invalid OID
ro: OID incorect inserat

source: maximum system OID is %u
ro: OID maxim pentru sistem este %u

source: missing pg_database entry for this database
ro: intrarea pg_database lipseºte pentru aceastã bazã de date

source: found more than one pg_database entry for this database
ro: au fost gãsite mai multe intrãri pg_database pentru aceastã bazã de date

source: could not find entry for pg_indexes in pg_class
ro: imposibil de gãsit intrarea pentru pg_indexes în pg_class

source: found more than one entry for pg_indexes in pg_class
ro: au fost gãsite mai multe intrãri pg_indexes în pg_class

source: query to get data of sequence "%s" returned %d rows (expected 1)
ro: interogarea pentru obþinerea datelor secvenþei "%s" a returnat %d rânduri (1 aºteptat)

source: query to get data of sequence "%s" returned name "%s"
ro: interogarea pentru obþinerea datelor secvenþei "%s" a returnat numele "%s"

source: invalid argument string (%s) for trigger "%s" on table "%s"
ro: argument incorect (%s) pentru declanºatorul "%s" pentru tabela "%s"

source: query to get rule "%s" for table "%s" failed: wrong number of rows returned
ro: interogarea pentru obþinerea regulii "%s" pentru tabela "%s" a eºuat: numãr incorect de rânduri returnate

source: reading dependency data
ro: citire date de suport

source: query yielded %d rows instead of one: %s
ro: interogarea a furnizat %d rânduri în loc de 1: %s

source: SQL command failed
ro: comanda SQL a eºuat

source: reading schemas
ro: citire scheme

source: reading user-defined functions
ro: citire funcþii definite de utilizator

source: reading user-defined types
ro: citire tipuri definite de utilizator

source: reading procedural languages
ro: citire limbaje procedurale

source: reading user-defined aggregate functions
ro: citire funcþii de agregare definite de utilizator

source: reading user-defined operators
ro: citire operatori definiþi de utilizator

source: reading user-defined operator classes
ro: citire clase de operatori definite de utilizator

source: reading user-defined conversions
ro: citire conversii definite de utilizator

source: reading user-defined tables
ro: citire tabele definite de utilizator

source: reading table inheritance information
ro: citire informaþii de moºtenire pentru tabele

source: reading rewrite rules
ro: citire reguli de rescriere

source: reading type casts
ro: citire conversii de tip

source: finding inheritance relationships
ro: gãsire relaþii de moºtenire

source: reading column info for interesting tables
ro: citire informaþii coloane pentru tabelele interesante

source: flagging inherited columns in subtables
ro: marcare coloane moºtenite în subtabele

source: reading indexes
ro: citire indexuri

source: reading constraints
ro: citire restricþii

source: reading triggers
ro: citire declanºatori

source: out of memory
ro: memorie insuficientã

source: failed sanity check, parent OID %u of table "%s" (OID %u) not found
ro: verificare de siguranþã eºuatã, OID pãrinte %u pentru tabela "%s" (OID %u) nu a fost gãsit

source: could not parse numeric array: too many numbers
ro: imposibil de analizat tabloul numeric: prea multe numere

source: could not parse numeric array: invalid character in number
ro: imposibil de analizat tabloul numeric: caracter incorect în numãr

source: archiver
ro: arhivator

source: could not close output archive file
ro: imposibil de închis fiºierul arhivã de ieºire

source: -C and -c are incompatible options
ro: opþiunile -C ºi -c sunt incompatibile

source: connecting to database for restore
ro: conectare la baza de date pentru restabilire

source: direct database connections are not supported in pre-1.3 archives
ro: conexiunile directe la baza de date nu sunt suportate în arhivele pre-1.3

source: implied data-only restore
ro: presupune restabilirea doar a datelor

source: dropping %s %s
ro: ºtergere %s %s

source: warning from original dump file: %s
ro: avertisment din fiºierul de descãrcare original: %s

source: creating %s %s
ro: creare %s %s

source: connecting to new database "%s"
ro: conectare la o nouã bazã de date "%s"

source: cannot restore from compressed archive (not configured for compression support)
ro: imposibil de restabilit din arhiva comprimatã (neconfigurat pentru compresie)

source: WARNING: skipping large-object restoration
ro: AVERTISMENT: se ignorã restabilirea obiectelor mari

source: restoring data for table "%s"
ro: restabilire date pentru tabela "%s"

source: fixing up large-object cross-reference for "%s"
ro: reparare referinþe încruciºate ale obiectelor mari pentru "%s"

source: executing %s %s
ro: executare %s %s

source: setting owner and privileges for %s %s
ro: setare proprietar ºi privilegii pentru %s %s

source: disabling triggers
ro: dezactivare declanºatori

source: enabling triggers
ro: activare declanºatori

source: internal error -- WriteData cannot be called outside the context of a DataDumper routine
ro: eroare internã -- WriteData nu poate fi apelatã în afara contextului unei rutine DataDumper

source: large-object output not supported in chosen format
ro: ieºire obiecte mari nesuportatã în formatul ales

source: committing large-object transactions
ro: finalizare tranzacþii pentru obiecte mari

source: restored %d large objects
ro: %d obiecte mari restabilite

source: cannot restore large objects without a database connection
ro: imposibil de restabilit obiecte mari fãrã o conexiune la baza de date

source: starting large-object transactions
ro: pornire tranzacþii pentru obiecte mari

source: could not create large object
ro: imposibil de creat obiectul mare

source: restoring large object with OID %u as %u
ro: restabilire obiect mare cu OID %u ca %u

source: could not open large object
ro: imposibil de deschis obiectul mare

source: wrote remaining %lu bytes of large-object data (result = %lu)
ro: scriere %lu octeþi rãmaºi din obiectul mare (rezultat = %lu)

source: could not write to large object (result: %lu, expected: %lu)
ro: imposibil de scris în obiectul mare (rezultat: %lu, aºteptat: %lu)

source: could not open TOC file
ro: imposibil de deschis fiºierul cuprins

source: WARNING: line ignored: %s
ro: AVERTISMENT: ignorare linie: %s

source: could not find entry for ID %d
ro: imposibil de gãsit intrarea pentru ID %d

source: could not close TOC file: %s
ro: imposibil de închis fiºierul cuprins: %s

source: could not open output file: %s
ro: imposibil de deschis fiºierul de ieºire: %s

source: could not close output file: %s
ro: imposibil de închis fiºierul de ieºire: %s

source: wrote %lu bytes of large object data (result = %lu)
ro: %lu octeþi din obiectul mare scriºi (rezultat = %lu)

source: could not write to compressed archive
ro: imposibil de scris în arhiva comprimatã

source: could not write to custom output routine
ro: imposibil de scris în rutina de ieºire specificã

source: could not write to output file (%lu != %lu)
ro: imposibil de scris în fiºierul de ieºire (%lu != %lu)

source: Error while INITIALIZING:
ro: Eroare în timpul iniþializãrii:

source: Error while PROCESSING TOC:
ro: Eroare în timpul procesãrii cuprinsului:

source: Error while FINALIZING:
ro: Eroare în timpul finalizãrii:

source: Error from TOC entry %d; %u %u %s %s %s
ro: Eroare din intrarea cuprinsului %d; %u %u %s %s %s

source: Unexpected data offset flag %d
ro: Marcator de decalare pentru date %d neaºteptat

source: file offset in dump file is too large
ro: decalarea fiºierului în fiºierul de descãrcare este prea mare

source: attempting to ascertain archive format
ro: încercare de stabilire a formatului arhivei

source: could not open input file: %s
ro: imposibil de deschis fiºierul de intrare: %s

source: could not read input file: %s
ro: imposibil de citit fiºierul de intrare: %s

source: input file is too short (read %lu, expected 5)
ro: fiºier de intrare prea scurt (%lu citit, aºteptat 5)

source: input file does not appear to be a valid archive (too short?)
ro: fiºierul de intrare nu pare sã fie o arhivã corectã (prea scurt?)

source: input file does not appear to be a valid archive
ro: fiºierul de intrare nu pare sã fie o arhivã corectã

source: read %lu bytes into lookahead buffer
ro: %lu octeþi citiþi în memoria tampon lookahead

source: could not close the input file after reading header: %s
ro: imposibil de închis fiºierul de intrare dupã citirea antetului: %s

source: allocating AH for %s, format %d
ro: alocare AH pentru %s, format %d

source: archive format is %d
ro: formatul arhivei este %d

source: unrecognized file format "%d"
ro: format de fiºier "%d" nerecunoscut

source: entry ID %d out of range -- perhaps a corrupt TOC
ro: ID-ul intrãrii (%d) este în afara intervalului -- probabil cuprinsul este corupt

source: read TOC entry %d (ID %d) for %s %s
ro: citire intrare în cuprins %d (ID %d) pentru %s %s

source: could not set session user to "%s": %s
ro: imposibil de setat utilizatorul sesiunii la "%s": %s

source: WARNING: don't know how to set owner for object type %s
ro: AVERTISMENT: nu existã o metodã de setare a proprietarului pentru obiectele de tipul %s

source: WARNING: requested compression not available in this installation -- archive will be uncompressed
ro: AVERTISMENT: compresia solicitatã nu este disponibilã în aceastã instalare -- arhiva va fi necomprimatã

source: did not find magic string in file header
ro: nu a fost gãsit ºirul magic în antet

source: unsupported version (%d.%d) in file header
ro: versiune nesuportatã (%d.%d) în antetul fiºierului

source: sanity check on integer size (%lu) failed
ro: verificare de siguranþã pentru dimensiunea întregilor (%lu) eºuatã

source: WARNING: archive was made on a machine with larger integers, some operations may fail
ro: AVERTISMENT: arhiva a fost creatã pe o maºinã cu întregi mai mari, unele operaþii ar putea eºua

source: expected format (%d) differs from format found in file (%d)
ro: formatul aºteptat (%d) diferã de formatul gãsit în fiºier (%d)

source: WARNING: archive is compressed, but this installation does not support compression -- no data will be available
ro: AVERTISMENT: arhiva este comprimatã, dar instalarea nu suportã compresia -- datele nu vor fi disponibile

source: WARNING: invalid creation date in header
ro: AVERTISMENT: data creãrii din antet este incorectã

source: custom archiver
ro: arhivator specific

source: could not open archive file "%s": %s
ro: imposibil de deschis fiºierul arhivã "%s": %s

source: invalid OID for large object
ro: OID incorect pentru obiectul mare

source: Dumping a specific TOC data block out of order is not supported without ID on this input stream (fseek required)
ro: Descãrcarea unui bloc defect de date cuprins nu este suportatã fãrã ID în acest flux de intrare (este necesar fseek)

source: unrecognized data block type (%d) while searching archive
ro: tip de bloc de date (%d) nerecunoscut întâlnit în timpul cãutãrii prin arhivã

source: error during file seek: %s
ro: eroare la cãutarea în fiºier: %s

source: found unexpected block ID (%d) when reading data -- expected %d
ro: ID de bloc neaºteptat (%d) întâlnit în timpul citirii datelor -- %d aºteptat

source: large objects cannot be loaded without a database connection
ro: obiectele mari nu pot fi încãrcate fãrã o conexiune la baza de date

source: unrecognized data block type %d while restoring archive
ro: tip de bloc de date (%d) nerecunoscut întâlnit în timpul restabilirii arhivei

source: could not initialize compression library: %s
ro: imposibil de iniþializat biblioteca pentru compresie: %s

source: could not read data block -- expected %lu, got %lu
ro: imposibil de citit blocul de date -- %lu aºteptat, %lu gãsit

source: could not uncompress data: %s
ro: imposibil de decomprimat datele: %s

source: could not close compression library: %s
ro: imposibil de închis biblioteca pentru compresie: %s

source: could not write byte: %s
ro: imposibil de scris octetul: %s

source: write error in _WriteBuf (%lu != %lu)
ro: eroare la scriere în _WriteBuf (%lu != %lu)

source: could not close archive file: %s
ro: imposibil de închis fiºierul arhivã: %s
