Repository: dvarrazzo/pgmessages
Catalog: */pg_resetxlog.po
Languages: ro

source: %s: invalid argument for option -x
ro: %s: argument incorect pentru opþiunea -x

source: Try "%s --help" for more information.
ro: Încercaþi "%s --help" pentru mai multe informaþii.

source: %s: transaction ID (-x) must not be 0
ro: %s: ID-ul tranzacþiei (-x) trebuie sã fie diferit de 0

source: %s: invalid argument for option -o
ro: %s: argument incorect pentru opþiunea -o

source: %s: OID (-o) must not be 0
ro: %s: OID (-o) trebuie sã fie diferit de 0

source: %s: invalid argument for option -l
ro: %s: argument incorect pentru opþiunea -l

source: %s: no data directory specified
ro: %s: nici un director de date specificat

source: %s: cannot be executed by "root"
ro: %s: nu poate fi executat de cãtre "root"

source: You must run %s as the PostgreSQL superuser.
ro: Trebuie sã rulaþi %s ca utilizatorul privilegiat pentru PostgreSQL.

source: %s: could not open file "%s" for reading: %s
ro: %s: imposibil de deschis fiºierul "%s" pentru citire: %s

source: %s: lock file "%s" exists Is a server running? If not, delete the lock file and try again.
ro: %s: fiºierul de blocare "%s" existã Ruleazã un server? Dacã nu, ºtergeþi fiºierul de blocare ºi încercaþi din nou.

source: If these values seem acceptable, use -f to force reset.
ro: Dacã aceste valori sunt acceptabile, folosiþi -f pentru a forþa reiniþializarea

source: The database server was not shut down cleanly. Resetting the transaction log may cause data to be lost. If you want to proceed anyway, use -f to force reset.
ro: Serverul de baze de date nu a fost închis corect. Reiniþializarea jurnalului de tranzacþii poate cauza pierderi de date. Dacã doriþi sã continuaþi oricum, folosiþi -f pentru a forþa reiniþializarea.

source: Transaction log reset
ro: Jurnalul de tranzacþii reiniþializat

source: If you are sure the data directory path is correct, execute touch %s and try again.
ro: Dacã sunteþi convins de corectitudinea cãii cãtre directorul de date, executaþi touch %s ºi încercaþi din nou.

source: %s: could not read file "%s": %s
ro: %s: imposibil de citit fiºierul "%s": %s

source: %s: pg_control exists but has invalid CRC; proceed with caution
ro: %s: pg_control existã, dar are suma de control CRC incorectã; continuaþi cu atenþie

source: %s: pg_control exists but is broken or unknown version; ignoring it
ro: %s: pg_control existã, dar este defect sau are o versiune necunoscutã; se ignorã

source: %s: invalid LC_COLLATE setting
ro: %s: setare LC_COLLATE incorectã

source: %s: invalid LC_CTYPE setting
ro: %s: setare LC_CTYPE incorectã

source: Guessed pg_control values:
ro: Valori pg_control ghicite:

source: pg_control values:
ro: Valori pg_control:

source: pg_control version number: %u
ro: Numãr versiune pg_control: %u

source: Catalog version number: %u
ro: Numãr versiune catalog: %u

source: Database system identifier: %s
ro: Identificator sistem baze de date: %s

source: Current log file ID: %u
ro: ID fiºier jurnal curent: %u

source: Next log file segment: %u
ro: Segment fiºier jurnal urmãtor: %u

source: Latest checkpoint's TimeLineID: %u
ro: TimeLineID ultimul punct de salvare: %u

source: Latest checkpoint's NextXID: %u
ro: NextXID ultimul punct de salvare: %u

source: Latest checkpoint's NextOID: %u
ro: NextOID ultimul punct de salvare: %u

source: Database block size: %u
ro: Dimensiune bloc bazã de date: %u

source: Blocks per segment of large relation: %u
ro: Blocuri/segment pentru relaþii mari: %u

source: Maximum length of identifiers: %u
ro: Lungime maximã a identificatorilor: %u

source: Maximum number of function arguments: %u
ro: Nr. maxim argumente pentru funcþii: %u

source: Date/time type storage: %s
ro: Stocare tip datã/timp: %s

source: 64-bit integers
ro: întregi pe 64 de biþi

source: floating-point numbers
ro: numere în virgulã mobilã

source: Maximum length of locale name: %u
ro: Lungime maximã a numelui localizãrii: %u

source: %s: internal error -- sizeof(ControlFileData) is too large ... fix xlog.c
ro: %s: eroare internã -- sizeof(ControlFileData) este prea mare ... corectaþi xlog.c

source: %s: could not create pg_control file: %s
ro: %s: imposibil de creat fiºierul pg_control: %s

source: %s: could not write pg_control file: %s
ro: %s: imposibil de scris fiºierul pg_control: %s

source: %s: fsync error: %s
ro: %s: eroare fsync: %s

source: %s: could not open directory "%s": %s
ro: %s: imposibil de deschis directorul "%s": %s

source: %s: could not delete file "%s": %s
ro: %s: imposibil de ºters directorul "%s": %s

source: %s: could not read from directory "%s": %s
ro: %s: imposibil de citit din directorul "%s": %s

source: %s: could not open file "%s": %s
ro: %s: imposibil de deschis fiºierul "%s": %s

source: %s: could not write file "%s": %s
ro: %s: imposibil de scris fiºierul "%s": %s

source: %s resets the PostgreSQL transaction log.
ro: %s reiniþializeazã jurnalul de tranzacþii PostgreSQL.

source: Usage: %s [OPTION]... DATADIR
ro: Utilizare: %s [OPÞIUNE]... DIRDATE

source: Options:
ro: Opþiuni:

source: -f force update to be done
ro: -f forþeazã actualizarea

source: -l TLI,FILE,SEG force minimum WAL starting location for new transaction log
ro: -l TLI,FIªIER,SEG forþeazã locaþia de start minimã WAL pentru noul jurnal de tranzacþii

source: -n no update, just show extracted control values (for testing)
ro: -n fãrã actualizare, doar afiºeazã valorile de control extrase (pentru testare)

source: -o OID set next OID
ro: -o OID seteazã urmãtorul OID

source: -x XID set next transaction ID
ro: -x XID seteazã urmãtorul ID de tranzacþie

source: --help show this help, then exit
ro: --help afiºeazã acest ajutor, apoi iese

source: --version output version information, then exit
ro: --version afiºeazã informaþiile despre versiune, apoi iese

source: Report bugs to <pgsql-bugs@postgresql.org>.
ro: Raportaþi erorile la <pgsql-bugs@postgresql.org>.
