Repository: dvarrazzo/pgmessages
Catalog: */psql.po
Languages: ro

source: remove a conversion
ro: eliminã o conversie

source: DROP CONVERSION name [ CASCADE | RESTRICT ]
ro: DROP CONVERSION nume [ CASCADE | RESTRICT ]

source: remove a database
ro: eliminã o bazã de date

source: DROP DATABASE name
ro: DROP DATABASE nume

source: remove a domain
ro: eliminã un domeniu

source: DROP DOMAIN name [, ...] [ CASCADE | RESTRICT ]
ro: DROP DOMAIN nume [, ...] [ CASCADE | RESTRICT ]

source: remove a function
ro: eliminã o funcþie

source: DROP FUNCTION name ( [ type [, ...] ] ) [ CASCADE | RESTRICT ]
ro: DROP FUNCTION nume ( [ tip [, ...] ] ) [ CASCADE | RESTRICT ]

source: remove a user group
ro: eliminã un grup de utilizatori

source: DROP GROUP name
ro: DROP GROUP nume

source: remove an index
ro: eliminã un index

source: DROP INDEX name [, ...] [ CASCADE | RESTRICT ]
ro: DROP INDEX nume [, ...] [ CASCADE | RESTRICT ]

source: remove a procedural language
ro: eliminã un limbaj procedural

source: DROP [ PROCEDURAL ] LANGUAGE name [ CASCADE | RESTRICT ]
ro: DROP [ PROCEDURAL ] LANGUAGE nume [ CASCADE | RESTRICT ]

source: remove an operator class
ro: eliminã o clasã de operatori

source: DROP OPERATOR CLASS name USING index_method [ CASCADE | RESTRICT ]
ro: DROP OPERATOR CLASS nume USING metodã_index [ CASCADE | RESTRICT ]

source: remove an operator
ro: eliminã un operator

source: DROP OPERATOR name ( { lefttype | NONE } , { righttype | NONE } ) [ CASCADE | RESTRICT ]
ro: DROP OPERATOR nume ( { tip_stânga | NONE } , { tip_dreapta | NONE } ) [ CASCADE | RESTRICT ]

source: remove a rewrite rule
ro: eliminã o regulã de rescriere

source: DROP RULE name ON relation [ CASCADE | RESTRICT ]
ro: DROP RULE nume ON relaþie [ CASCADE | RESTRICT ]

source: remove a schema
ro: eliminã o schemã

source: DROP SCHEMA name [, ...] [ CASCADE | RESTRICT ]
ro: DROP SCHEMA nume [, ...] [ CASCADE | RESTRICT ]

source: remove a sequence
ro: eliminã o secvenþã

source: DROP SEQUENCE name [, ...] [ CASCADE | RESTRICT ]
ro: DROP SEQUENCE nume [, ...] [ CASCADE | RESTRICT ]

source: remove a table
ro: eliminã o tabelã

source: DROP TABLE name [, ...] [ CASCADE | RESTRICT ]
ro: DROP TABLE nume [, ...] [ CASCADE | RESTRICT ]

source: remove a tablespace
ro: eliminã un spaþiu de tabele

source: DROP TABLESPACE tablespacename
ro: DROP TABLESPACE nume_spaþiu_tabele

source: remove a trigger
ro: eliminã un declanºator

source: DROP TRIGGER name ON table [ CASCADE | RESTRICT ]
ro: DROP TRIGGER nume ON tabelã [ CASCADE | RESTRICT ]

source: remove a data type
ro: eliminã un tip de datã

source: DROP TYPE name [, ...] [ CASCADE | RESTRICT ]
ro: DROP TYPE nume [, ...] [ CASCADE | RESTRICT ]

source: remove a database user account
ro: eliminã un cont de utilizator de bazã de date

source: DROP USER name
ro: DROP USER nume

source: remove a view
ro: eliminã o vizualizare

source: DROP VIEW name [, ...] [ CASCADE | RESTRICT ]
ro: DROP VIEW nume [, ...] [ CASCADE | RESTRICT ]

source: execute a prepared statement
ro: executã o instrucþiune preparatã

source: EXECUTE plan_name [ (parameter [, ...] ) ]
ro: EXECUTE nume_plan [ (parametru [, ...] ) ]

source: show the execution plan of a statement
ro: afiºeazã planul de execuþie pentru o instrucþiune

source: EXPLAIN [ ANALYZE ] [ VERBOSE ] statement
ro: EXPLAIN [ ANALYZE ] [ VERBOSE ] instrucþiune

source: retrieve rows from a query using a cursor
ro: transferã rândurile dintr-o interogare folosind un cursor

source: FETCH [ direction { FROM | IN } ] cursorname where direction can be empty or one of: NEXT PRIOR FIRST LAST ABSOLUTE count RELATIVE count count ALL FORWARD FORWARD count FORWARD ALL BACKWARD BACKWARD count BACKWARD ALL
ro: FETCH [ direcþie { FROM | IN } ] nume_cursor unde direcþie poate fi goalã sau una dintre: NEXT PRIOR FIRST LAST ABSOLUTE numãr RELATIVE numãr numãr ALL FORWARD FORWARD numãr FORWARD ALL BACKWARD BACKWARD numãr BACKWARD ALL

source: define access privileges
ro: defineºte drepturi de acces

source: GRANT { { SELECT | INSERT | UPDATE | DELETE | RULE | REFERENCES | TRIGGER } [,...] | ALL [ PRIVILEGES ] } ON [ TABLE ] tablename [, ...] TO { username | GROUP groupname | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { { CREATE | TEMPORARY | TEMP } [,...] | ALL [ PRIVILEGES ] } ON DATABASE dbname [, ...] TO { username | GROUP groupname | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { EXECUTE | ALL [ PRIVILEGES ] } ON FUNCTION funcname ([type, ...]) [, ...] TO { username | GROUP groupname | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { USAGE | ALL [ PRIVILEGES ] } ON LANGUAGE langname [, ...] TO { username | GROUP groupname | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { { CREATE | USAGE } [,...] | ALL [ PRIVILEGES ] } ON SCHEMA schemaname [, ...] TO { username | GROUP groupname | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { CREATE | ALL [ PRIVILEGES ] } ON TABLESPACE tablespacename [, ...] TO { username | GROUP groupname | PUBLIC } [, ...] [ WITH GRANT OPTION ]
ro: GRANT { { SELECT | INSERT | UPDATE | DELETE | RULE | REFERENCES | TRIGGER } [,...] | ALL [ PRIVILEGES ] } ON [ TABLE ] nume_tabelã [, ...] TO { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { { CREATE | TEMPORARY | TEMP } [,...] | ALL [ PRIVILEGES ] } ON DATABASE nume_bd [, ...] TO { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { EXECUTE | ALL [ PRIVILEGES ] } ON FUNCTION nume_funcþie ([tip, ...]) [, ...] TO { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { USAGE | ALL [ PRIVILEGES ] } ON LANGUAGE nume_limbaj [, ...] TO { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { { CREATE | USAGE } [,...] | ALL [ PRIVILEGES ] } ON SCHEMA nume_schemã [, ...] TO { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ WITH GRANT OPTION ] GRANT { CREATE | ALL [ PRIVILEGES ] } ON TABLESPACE nume_spaþiu_tabele [, ...] TO { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ WITH GRANT OPTION ]

source: create new rows in a table
ro: creeazã rânduri noi într-o tabelã

source: INSERT INTO table [ ( column [, ...] ) ] { DEFAULT VALUES | VALUES ( { expression | DEFAULT } [, ...] ) | query }
ro: INSERT INTO tabelã [ ( coloanã [, ...] ) ] { DEFAULT VALUES | VALUES ( { expresie | DEFAULT } [, ...] ) | interogare }

source: listen for a notification
ro: aºteaptã o notificare

source: LISTEN name
ro: LISTEN nume

source: load or reload a shared library file
ro: încarcã sau re-încarcã o bibliotecã partajatã

source: LOAD 'filename'
ro: LOAD 'nume_fiºier'

source: lock a table
ro: blocheazã o tabelã

source: LOCK [ TABLE ] name [, ...] [ IN lockmode MODE ] [ NOWAIT ] where lockmode is one of: ACCESS SHARE | ROW SHARE | ROW EXCLUSIVE | SHARE UPDATE EXCLUSIVE | SHARE | SHARE ROW EXCLUSIVE | EXCLUSIVE | ACCESS EXCLUSIVE
ro: LOCK [ TABLE ] nume [, ...] [ IN mod_blocare MODE ] [ NOWAIT ] unde mod_blocare este unul dintre: ACCESS SHARE | ROW SHARE | ROW EXCLUSIVE | SHARE UPDATE EXCLUSIVE | SHARE | SHARE ROW EXCLUSIVE | EXCLUSIVE | ACCESS EXCLUSIVE

source: position a cursor
ro: poziþioneazã un cursor

source: MOVE [ direction { FROM | IN } ] cursorname
ro: MOVE [ direcþie { FROM | IN } ] nume_cursor

source: generate a notification
ro: genereazã o notificare

source: NOTIFY name
ro: NOTIFY nume

source: prepare a statement for execution
ro: preparã o instrucþiune pentru execuþie

source: PREPARE plan_name [ (datatype [, ...] ) ] AS statement
ro: PREPARE nume_plan [ (tip_datã [, ...] ) ] AS instrucþiune

source: rebuild indexes
ro: reconstruieºte indexuri

source: REINDEX { DATABASE | TABLE | INDEX } name [ FORCE ]
ro: REINDEX { DATABASE | TABLE | INDEX } nume [ FORCE ]

source: destroy a previously defined savepoint
ro: distruge un punct de salvare definit anterior

source: RELEASE [ SAVEPOINT ] savepoint_name
ro: RELEASE [ SAVEPOINT ] nume_punct_salvare

source: restore the value of a run-time parameter to the default value
ro: restabileºte valoarea unui parametru de la momentul rulãrii la valoarea implicitã

source: RESET name RESET ALL
ro: RESET nume RESET ALL

source: remove access privileges
ro: eliminã drepturile de acces

source: REVOKE [ GRANT OPTION FOR ] { { SELECT | INSERT | UPDATE | DELETE | RULE | REFERENCES | TRIGGER } [,...] | ALL [ PRIVILEGES ] } ON [ TABLE ] tablename [, ...] FROM { username | GROUP groupname | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { { CREATE | TEMPORARY | TEMP } [,...] | ALL [ PRIVILEGES ] } ON DATABASE dbname [, ...] FROM { username | GROUP groupname | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { EXECUTE | ALL [ PRIVILEGES ] } ON FUNCTION funcname ([type, ...]) [, ...] FROM { username | GROUP groupname | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { USAGE | ALL [ PRIVILEGES ] } ON LANGUAGE langname [, ...] FROM { username | GROUP groupname | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { { CREATE | USAGE } [,...] | ALL [ PRIVILEGES ] } ON SCHEMA schemaname [, ...] FROM { username | GROUP groupname | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { CREATE | ALL [ PRIVILEGES ] } ON TABLESPACE tablespacename [, ...] FROM { username | GROUP groupname | PUBLIC } [, ...] [ CASCADE | RESTRICT ]
ro: REVOKE [ GRANT OPTION FOR ] { { SELECT | INSERT | UPDATE | DELETE | RULE | REFERENCES | TRIGGER } [,...] | ALL [ PRIVILEGES ] } ON [ TABLE ] nume_tabelã [, ...] FROM { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { { CREATE | TEMPORARY | TEMP } [,...] | ALL [ PRIVILEGES ] } ON DATABASE nume_bd [, ...] FROM { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { EXECUTE | ALL [ PRIVILEGES ] } ON FUNCTION nume_funcþie ([tip, ...]) [, ...] FROM { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { USAGE | ALL [ PRIVILEGES ] } ON LANGUAGE nume_limbaj [, ...] FROM { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { { CREATE | USAGE } [,...] | ALL [ PRIVILEGES ] } ON SCHEMA nume_schemã [, ...] FROM { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ CASCADE | RESTRICT ] REVOKE [ GRANT OPTION FOR ] { CREATE | ALL [ PRIVILEGES ] } ON TABLESPACE nume_spaþiu_tabele [, ...] FROM { nume_utilizator | GROUP nume_grup | PUBLIC } [, ...] [ CASCADE | RESTRICT ]

source: roll back to a savepoint
ro: anuleazã modificãrile pânã la un punct de salvare

source: ROLLBACK [ WORK | TRANSACTION ] TO [ SAVEPOINT ] savepoint_name
ro: ROLLBACK [ WORK | TRANSACTION ] TO [ SAVEPOINT ] nume_punct_salvare

source: define a new savepoint within the current transaction
ro: defineºte un punct de salvare nou în tranzacþia curentã

source: SAVEPOINT savepoint_name
ro: SAVEPOINT nume_punct_salvare

source: retrieve rows from a table or view
ro: transferã rânduri dintr-o tabelã sau vizualizare

source: SELECT [ ALL | DISTINCT [ ON ( expression [, ...] ) ] ] * | expression [ AS output_name ] [, ...] [ FROM from_item [, ...] ] [ WHERE condition ] [ GROUP BY expression [, ...] ] [ HAVING condition [, ...] ] [ { UNION | INTERSECT | EXCEPT } [ ALL ] select ] [ ORDER BY expression [ ASC | DESC | USING operator ] [, ...] ] [ LIMIT { count | ALL } ] [ OFFSET start ] [ FOR UPDATE [ OF table_name [, ...] ] ] where from_item can be one of: [ ONLY ] table_name [ * ] [ [ AS ] alias [ ( column_alias [, ...] ) ] ] ( select ) [ AS ] alias [ ( column_alias [, ...] ) ] function_name ( [ argument [, ...] ] ) [ AS ] alias [ ( column_alias [, ...] | column_definition [, ...] ) ] function_name ( [ argument [, ...] ] ) AS ( column_definition [, ...] ) from_item [ NATURAL ] join_type from_item [ ON join_condition | USING ( join_column [, ...] ) ]
ro: SELECT [ ALL | DISTINCT [ ON ( expresie [, ...] ) ] ] * | expresie [ AS nume_ieºire ] [, ...] [ FROM din_element [, ...] ] [ WHERE condiþie ] [ GROUP BY expresie [, ...] ] [ HAVING condiþie [, ...] ] [ { UNION | INTERSECT | EXCEPT } [ ALL ] select ] [ ORDER BY expresie [ ASC | DESC | USING operator ] [, ...] ] [ LIMIT { numãr | ALL } ] [ OFFSET start ] [ FOR UPDATE [ OF nume_tabelã [, ...] ] ] unde din_element poate fi unul dintre: [ ONLY ] nume_tabelã [ * ] [ [ AS ] alias [ ( alias_coloanã [, ...] ) ] ] ( select ) [ AS ] alias [ ( alias_coloanã [, ...] ) ] nume_funcþie ( [ argument [, ...] ] ) [ AS ] alias [ ( alias_coloanã [, ...] | definiþie_coloanã [, ...] ) ] nume_funcþie ( [ argument [, ...] ] ) AS ( definiþie_coloanã [, ...] ) din_element [ NATURAL ] tip_relaþionare from_item [ ON condiþie_relaþionare | USING ( coloanã_relaþionare [, ...] ) ]

source: SELECT [ ALL | DISTINCT [ ON ( expression [, ...] ) ] ] * | expression [ AS output_name ] [, ...] INTO [ TEMPORARY | TEMP ] [ TABLE ] new_table [ FROM from_item [, ...] ] [ WHERE condition ] [ GROUP BY expression [, ...] ] [ HAVING condition [, ...] ] [ { UNION | INTERSECT | EXCEPT } [ ALL ] select ] [ ORDER BY expression [ ASC | DESC | USING operator ] [, ...] ] [ LIMIT { count | ALL } ] [ OFFSET start ] [ FOR UPDATE [ OF tablename [, ...] ] ]
ro: SELECT [ ALL | DISTINCT [ ON ( expresie [, ...] ) ] ] * | expresie [ AS nume_ieºire ] [, ...] INTO [ TEMPORARY | TEMP ] [ TABLE ] tabelã_nouã [ FROM din_element [, ...] ] [ WHERE condiþie ] [ GROUP BY expresie [, ...] ] [ HAVING condiþie [, ...] ] [ { UNION | INTERSECT | EXCEPT } [ ALL ] select ] [ ORDER BY expresie [ ASC | DESC | USING operator ] [, ...] ] [ LIMIT { numãr | ALL } ] [ OFFSET start ] [ FOR UPDATE [ OF nume_tabelã [, ...] ] ]

source: change a run-time parameter
ro: modificã un parametru de la momentul rulãrii

source: SET [ SESSION | LOCAL ] name { TO | = } { value | 'value' | DEFAULT } SET [ SESSION | LOCAL ] TIME ZONE { timezone | LOCAL | DEFAULT }
ro: SET [ SESSION | LOCAL ] nume { TO | = } { valoare | 'valoare' | DEFAULT } SET [ SESSION | LOCAL ] TIME ZONE { zonã_timp | LOCAL | DEFAULT }

source: set constraint checking modes for the current transaction
ro: seteazã modurile de verificare a restricþiilor pentru tranzacþia curentã

source: SET CONSTRAINTS { ALL | name [, ...] } { DEFERRED | IMMEDIATE }
ro: SET CONSTRAINTS { ALL | nume [, ...] } { DEFERRED | IMMEDIATE }

source: set the session user identifier and the current user identifier of the current session
ro: seteazã identificatorul de sesiune al utilizatorului ºi identificatorul curent al utilizatorului pentru sesiunea curentã

source: SET [ SESSION | LOCAL ] SESSION AUTHORIZATION username SET [ SESSION | LOCAL ] SESSION AUTHORIZATION DEFAULT RESET SESSION AUTHORIZATION
ro: SET [ SESSION | LOCAL ] SESSION AUTHORIZATION nume_utilizator SET [ SESSION | LOCAL ] SESSION AUTHORIZATION DEFAULT RESET SESSION AUTHORIZATION

source: set the characteristics of the current transaction
ro: seteazã caracteristicile tranzacþiei curente

source: SET TRANSACTION transaction_mode [, ...] SET SESSION CHARACTERISTICS AS TRANSACTION transaction_mode [, ...] where transaction_mode is one of: ISOLATION LEVEL { SERIALIZABLE | REPEATABLE READ | READ COMMITTED | READ UNCOMMITTED } READ WRITE | READ ONLY
ro: SET TRANSACTION mod_tranzacþie [, ...] SET SESSION CHARACTERISTICS AS TRANSACTION mod_tranzacþie [, ...] unde mod_tranzacþie este unul dintre: ISOLATION LEVEL { SERIALIZABLE | REPEATABLE READ | READ COMMITTED | READ UNCOMMITTED } READ WRITE | READ ONLY

source: show the value of a run-time parameter
ro: afiºeazã valoarea unui parametru de la momentul rulãrii

source: SHOW name SHOW ALL
ro: SHOW nume SHOW ALL

source: START TRANSACTION [ transaction_mode [, ...] ] where transaction_mode is one of: ISOLATION LEVEL { SERIALIZABLE | REPEATABLE READ | READ COMMITTED | READ UNCOMMITTED } READ WRITE | READ ONLY
ro: START TRANSACTION [ mod_tranzacþie [, ...] ] unde mod_tranzacþie este unul dintre: ISOLATION LEVEL { SERIALIZABLE | REPEATABLE READ | READ COMMITTED | READ UNCOMMITTED } READ WRITE | READ ONLY

source: empty a table
ro: goleºte o tabelã

source: TRUNCATE [ TABLE ] name
ro: TRUNCATE [ TABLE ] nume

source: stop listening for a notification
ro: renunþã sã mai aºtepte o notificare

source: UNLISTEN { name | * }
ro: UNLISTEN { nume | * }

source: update rows of a table
ro: actualizeazã rândurile unei tabele

source: UPDATE [ ONLY ] table SET column = { expression | DEFAULT } [, ...] [ FROM fromlist ] [ WHERE condition ]
ro: UPDATE [ ONLY ] tabelã SET coloanã = { expresie | DEFAULT } [, ...] [ FROM din_listã ] [ WHERE condiþie ]

source: garbage-collect and optionally analyze a database
ro: curãþã o bazã de date ºi, opþional, o analizeazã

source: VACUUM [ FULL | FREEZE ] [ VERBOSE ] [ table ] VACUUM [ FULL | FREEZE ] [ VERBOSE ] ANALYZE [ table [ (column [, ...] ) ] ]
ro: VACUUM [ FULL | FREEZE ] [ VERBOSE ] [ tabelã ] VACUUM [ FULL | FREEZE ] [ VERBOSE ] ANALYZE [ tabelã [ (coloanã [, ...] ) ] ]

source: could not identify current directory: %s
ro: imposibil de identificat directorul curent: %s

source: invalid binary "%s"
ro: binar incorect "%s"

source: could not read binary "%s"
ro: imposibil de citit binar "%s"

source: could not find a "%s" to execute
ro: imposibil de gãsit "%s" pentru executare

source: could not change directory to "%s"
ro: imposibil de schimbat directorul în "%s"

source: could not read symbolic link "%s"
ro: imposibil de citit legãtura simbolicã "%s"

source: child process exited with exit code %d
ro: procesul fiu a ieºit cu codul %d

source: child process was terminated by signal %d
ro: procesul fiu a fost terminat cu semnalul %d

source: child process exited with unrecognized status %d
ro: procesul fiu a ieºit cu starea nerecunoscutã %d
