Repository: dvarrazzo/pgmessages
Catalog: */psql.po
Languages: ro

source: ALTER CONVERSION name RENAME TO newname ALTER CONVERSION name OWNER TO newowner
ro: ALTER CONVERSION nume RENAME TO nume_nou ALTER CONVERSION nume OWNER TO proprietar_nou

source: change a database
ro: modificã o bazã de date

source: ALTER DATABASE name SET parameter { TO | = } { value | DEFAULT } ALTER DATABASE name RESET parameter ALTER DATABASE name RENAME TO newname ALTER DATABASE name OWNER TO new_owner
ro: ALTER DATABASE nume SET parametru { TO | = } { valoare | DEFAULT } ALTER DATABASE nume RESET parametru ALTER DATABASE nume RENAME TO nume_nou ALTER DATABASE nume OWNER TO proprietar_nou

source: change the definition of a domain
ro: modificã definiþia unui domeniu

source: ALTER DOMAIN name { SET DEFAULT expression | DROP DEFAULT } ALTER DOMAIN name { SET | DROP } NOT NULL ALTER DOMAIN name ADD domain_constraint ALTER DOMAIN name DROP CONSTRAINT constraint_name [ RESTRICT | CASCADE ] ALTER DOMAIN name OWNER TO new_owner
ro: ALTER DOMAIN nume { SET DEFAULT expresie | DROP DEFAULT } ALTER DOMAIN nume { SET | DROP } NOT NULL ALTER DOMAIN nume ADD restricþie_domeniu ALTER DOMAIN nume DROP CONSTRAINT nume_restricþie [ RESTRICT | CASCADE ] ALTER DOMAIN nume OWNER TO proprietar_nou

source: change the definition of a function
ro: modificã definiþia unei funcþii

source: ALTER FUNCTION name ( [ type [, ...] ] ) RENAME TO newname ALTER FUNCTION name ( [ type [, ...] ] ) OWNER TO newowner
ro: ALTER FUNCTION nume ( [ tip [, ...] ] ) RENAME TO nume_nou ALTER FUNCTION nume ( [ tip [, ...] ] ) OWNER TO proprietar_nou

source: change a user group
ro: modificã un grup de utilizatori

source: ALTER GROUP groupname ADD USER username [, ... ] ALTER GROUP groupname DROP USER username [, ... ] ALTER GROUP groupname RENAME TO newname
ro: ALTER GROUP nume_grup ADD USER nume_utilizator [, ... ] ALTER GROUP nume_grup DROP USER nume_utilizator [, ... ] ALTER GROUP nume_grup RENAME TO nume_nou

source: change the definition of an index
ro: modificã definiþia unui index

source: ALTER INDEX name action [, ... ] ALTER INDEX name RENAME TO new_name where action is one of: OWNER TO new_owner SET TABLESPACE indexspace_name
ro: ALTER INDEX nume acþiune [, ... ] ALTER INDEX nume RENAME TO nume_nou acþiunea este una dintre: OWNER TO proprietar_nou SET TABLESPACE nume_spaþii_indexuri

source: change the definition of a procedural language
ro: modificã definiþia unui limbaj procedural

source: ALTER LANGUAGE name RENAME TO newname
ro: ALTER LANGUAGE nume RENAME TO nume_nou

source: change the definition of an operator class
ro: modificã definiþia unei clase de operatori

source: ALTER OPERATOR CLASS name USING index_method RENAME TO newname ALTER OPERATOR CLASS name USING index_method OWNER TO newowner
ro: ALTER OPERATOR CLASS nume USING metodã_index RENAME TO nume_nou ALTER OPERATOR CLASS nume USING metodã_index OWNER TO proprietar_nou

source: change the definition of an operator
ro: modificã definiþia unui operator

source: ALTER OPERATOR name ( { lefttype | NONE } , { righttype | NONE } ) OWNER TO newowner
ro: ALTER OPERATOR nume ( { tip_stânga | NONE } , { tip_dreapta | NONE } ) OWNER TO proprietar_nou

source: change the definition of a schema
ro: modificã definiþia unei scheme

source: ALTER SCHEMA name RENAME TO newname ALTER SCHEMA name OWNER TO newowner
ro: ALTER SCHEMA nume RENAME TO nume_nou ALTER SCHEMA nume OWNER TO proprietar_nou

source: change the definition of a sequence generator
ro: modificã definiþia unui generator de secvenþã

source: ALTER SEQUENCE name [ INCREMENT [ BY ] increment ] [ MINVALUE minvalue | NO MINVALUE ] [ MAXVALUE maxvalue | NO MAXVALUE ] [ RESTART [ WITH ] start ] [ CACHE cache ] [ [ NO ] CYCLE ]
ro: ALTER SEQUENCE nume [ INCREMENT [ BY ] increment ] [ MINVALUE valoare_min | NO MINVALUE ] [ MAXVALUE valoare_max | NO MAXVALUE ] [ RESTART [ WITH ] start ] [ CACHE cache ] [ [ NO ] CYCLE ]

source: change the definition of a table
ro: modificã definiþia unei tabele

source: ALTER TABLE [ ONLY ] name [ * ] action [, ... ] ALTER TABLE [ ONLY ] name [ * ] RENAME [ COLUMN ] column TO new_column ALTER TABLE name RENAME TO new_name where action is one of: ADD [ COLUMN ] column type [ column_constraint [ ... ] ] DROP [ COLUMN ] column [ RESTRICT | CASCADE ] ALTER [ COLUMN ] column TYPE type [ USING expression ] ALTER [ COLUMN ] column SET DEFAULT expression ALTER [ COLUMN ] column DROP DEFAULT ALTER [ COLUMN ] column { SET | DROP } NOT NULL ALTER [ COLUMN ] column SET STATISTICS integer ALTER [ COLUMN ] column SET STORAGE { PLAIN | EXTERNAL | EXTENDED | MAIN } ADD table_constraint DROP CONSTRAINT constraint_name [ RESTRICT | CASCADE ] CLUSTER ON index_name SET WITHOUT CLUSTER SET WITHOUT OIDS OWNER TO new_owner SET TABLESPACE tablespace_name
ro: ALTER TABLE [ ONLY ] nume [ * ] acþiune [, ... ] ALTER TABLE [ ONLY ] nume [ * ] RENAME [ COLUMN ] coloanã TO coloanã_nouã ALTER TABLE nume RENAME TO nume_nou acþiune este una dintre: ADD [ COLUMN ] coloanã tip [ restricþie_coloanã [ ... ] ] DROP [ COLUMN ] coloanã [ RESTRICT | CASCADE ] ALTER [ COLUMN ] coloanã TYPE tip [ USING expresie ] ALTER [ COLUMN ] coloanã SET DEFAULT expresie ALTER [ COLUMN ] coloanã DROP DEFAULT ALTER [ COLUMN ] coloanã { SET | DROP } NOT NULL ALTER [ COLUMN ] coloanã SET STATISTICS întreg ALTER [ COLUMN ] coloanã SET STORAGE { PLAIN | EXTERNAL | EXTENDED | MAIN } ADD restricþie_tabelã DROP CONSTRAINT nume_restricþie [ RESTRICT | CASCADE ] CLUSTER ON nume_index SET WITHOUT CLUSTER SET WITHOUT OIDS OWNER TO proprietar_nou SET TABLESPACE nume_spaþiu_tabelã

source: change the definition of a tablespace
ro: modificã definiþia unui spaþiu de tabele

source: ALTER TABLESPACE name RENAME TO newname ALTER TABLESPACE name OWNER TO newowner
ro: ALTER TABLESPACE nume RENAME TO nume_nou ALTER TABLESPACE nume OWNER TO proprietar_nou

source: change the definition of a trigger
ro: modificã definiþia unui declanºator

source: ALTER TRIGGER name ON table RENAME TO newname
ro: ALTER TRIGGER nume ON tabelã RENAME TO nume_nou

source: change the definition of a type
ro: modificã definiþia unui tip

source: ALTER TYPE name OWNER TO new_owner
ro: ALTER TYPE nume OWNER TO proprietar_nou

source: change a database user account
ro: modificã un cont de utilizator de bazã de date

source: ALTER USER name [ [ WITH ] option [ ... ] ] where option can be: CREATEDB | NOCREATEDB | CREATEUSER | NOCREATEUSER | [ ENCRYPTED | UNENCRYPTED ] PASSWORD 'password' | VALID UNTIL 'abstime' ALTER USER name RENAME TO newname ALTER USER name SET parameter { TO | = } { value | DEFAULT } ALTER USER name RESET parameter
ro: ALTER USER nume [ [ WITH ] opþiune [ ... ] ] unde opþiune poate fi: CREATEDB | NOCREATEDB | CREATEUSER | NOCREATEUSER | [ ENCRYPTED | UNENCRYPTED ] PASSWORD 'parolã' | VALID UNTIL 'timp_absolut' ALTER USER nume RENAME TO nume_nou ALTER USER nume SET parametru { TO | = } { valoare | DEFAULT } ALTER USER nume RESET parametru

source: collect statistics about a database
ro: colecteazã statistici despre o bazã de date

source: ANALYZE [ VERBOSE ] [ table [ (column [, ...] ) ] ]
ro: ANALYZE [ VERBOSE ] [ tabelã [ (coloanã [, ...] ) ] ]

source: start a transaction block
ro: iniþiazã un bloc de tranzacþie

source: BEGIN [ WORK | TRANSACTION ] [ transaction_mode [, ...] ] where transaction_mode is one of: ISOLATION LEVEL { SERIALIZABLE | REPEATABLE READ | READ COMMITTED | READ UNCOMMITTED } READ WRITE | READ ONLY
ro: BEGIN [ WORK | TRANSACTION ] [ mod_tranzacþie [, ...] ] unde mod_tranzacþie este unul dintre: ISOLATION LEVEL { SERIALIZABLE | REPEATABLE READ | READ COMMITTED | READ UNCOMMITTED } READ WRITE | READ ONLY

source: force a transaction log checkpoint
ro: forþeazã un punct de control al jurnalului de tranzacþii

source: close a cursor
ro: închide un cursor

source: CLOSE name
ro: CLOSE nume

source: cluster a table according to an index
ro: grupeazã o tabelã conform unui index

source: CLUSTER indexname ON tablename CLUSTER tablename CLUSTER
ro: CLUSTER nume_index ON nume_tabelã CLUSTER nume_tabelã CLUSTER

source: define or change the comment of an object
ro: defineºte sau modificã comentariul unui obiect

source: COMMENT ON { TABLE object_name | COLUMN table_name.column_name | AGGREGATE agg_name (agg_type) | CAST (sourcetype AS targettype) | CONSTRAINT constraint_name ON table_name | CONVERSION object_name | DATABASE object_name | DOMAIN object_name | FUNCTION func_name (arg1_type, arg2_type, ...) | INDEX object_name | LARGE OBJECT large_object_oid | OPERATOR op (leftoperand_type, rightoperand_type) | OPERATOR CLASS object_name USING index_method | [ PROCEDURAL ] LANGUAGE object_name | RULE rule_name ON table_name | SCHEMA object_name | SEQUENCE object_name | TRIGGER trigger_name ON table_name | TYPE object_name | VIEW object_name } IS 'text'
ro: COMMENT ON { TABLE nume_obiect | COLUMN nume_tabelã.nume_coloanã | AGGREGATE nume_agregare (tip_agregare) | CAST (tip_sursã AS tip_destinaþie) | CONSTRAINT nume_restricþie ON nume_tabelã | CONVERSION nume_obiect | DATABASE nume_obiect | DOMAIN nume_obiect | FUNCTION nume_funcþie (tip_arg1, tip_arg2, ...) | INDEX nume_obiect | LARGE OBJECT oid_obiect_mare | OPERATOR op (tip_operand_stâng, tip_operand_drept) | OPERATOR CLASS nume_obiect USING metodã_index | [ PROCEDURAL ] LANGUAGE nume_obiect | RULE nume_regulã ON nume_tabelã | SCHEMA nume_obiect | SEQUENCE nume_obiect | TRIGGER nume_declanºator ON nume_tabelã | TYPE nume_obiect | VIEW nume_obiect } IS 'text'

source: commit the current transaction
ro: finalizeazã tranzacþia curentã

source: copy data between a file and a table
ro: copiazã date între un fiºier ºi o tabelã

source: COPY tablename [ ( column [, ...] ) ] FROM { 'filename' | STDIN } [ [ WITH ] [ BINARY ] [ OIDS ] [ DELIMITER [ AS ] 'delimiter' ] [ NULL [ AS ] 'null string' ] [ CSV [ QUOTE [ AS ] 'quote' ] [ ESCAPE [ AS ] 'escape' ] [ FORCE NOT NULL column [, ...] ] COPY tablename [ ( column [, ...] ) ] TO { 'filename' | STDOUT } [ [ WITH ] [ BINARY ] [ OIDS ] [ DELIMITER [ AS ] 'delimiter' ] [ NULL [ AS ] 'null string' ] [ CSV [ QUOTE [ AS ] 'quote' ] [ ESCAPE [ AS ] 'escape' ] [ FORCE QUOTE column [, ...] ]
ro: COPY nume_tabelã [ ( coloanã [, ...] ) ] FROM { 'nume_fiºier' | STDIN } [ [ WITH ] [ BINARY ] [ OIDS ] [ DELIMITER [ AS ] 'delimitator' ] [ NULL [ AS ] 'ºir nul' ] [ CSV [ QUOTE [ AS ] 'caracter citare' ] [ ESCAPE [ AS ] 'caracter pentru escape' ] [ FORCE NOT NULL coloanã [, ...] ] COPY nume_tabelã [ ( coloanã [, ...] ) ] TO { 'nume_fiºier' | STDOUT } [ [ WITH ] [ BINARY ] [ OIDS ] [ DELIMITER [ AS ] 'delimitator' ] [ NULL [ AS ] 'ºir nul' ] [ CSV [ QUOTE [ AS ] 'caracter citare' ] [ ESCAPE [ AS ] 'caracter pentru escape' ] [ FORCE QUOTE coloanã [, ...] ]

source: define a new aggregate function
ro: defineºte o nouã funcþie de agregare

source: CREATE AGGREGATE name ( BASETYPE = input_data_type, SFUNC = sfunc, STYPE = state_data_type [ , FINALFUNC = ffunc ] [ , INITCOND = initial_condition ] )
ro: CREATE AGGREGATE nume ( BASETYPE = tip_date_intrare, SFUNC = funcþie_tranziþie_stare, STYPE = tip_date_stare [ , FINALFUNC = funcþie_calcul_final ] [ , INITCOND = condiþie_iniþialã ] )

source: define a new cast
ro: defineºte o conversie de tip nouã

source: CREATE CAST (sourcetype AS targettype) WITH FUNCTION funcname (argtypes) [ AS ASSIGNMENT | AS IMPLICIT ] CREATE CAST (sourcetype AS targettype) WITHOUT FUNCTION [ AS ASSIGNMENT | AS IMPLICIT ]
ro: CREATE CAST (tip_sursã AS tip_destinaþie) WITH FUNCTION nume_funcþie (tip_argumente) [ AS ASSIGNMENT | AS IMPLICIT ] CREATE CAST (tip_sursã AS tip_destinaþie) WITHOUT FUNCTION [ AS ASSIGNMENT | AS IMPLICIT ]

source: define a new constraint trigger
ro: defineºte un nou declanºator de restricþie

source: CREATE CONSTRAINT TRIGGER name AFTER events ON tablename constraint attributes FOR EACH ROW EXECUTE PROCEDURE funcname ( args )
ro: CREATE CONSTRAINT TRIGGER nume AFTER evenimente ON nume_tabelã restricþie atribute FOR EACH ROW EXECUTE PROCEDURE nume_funcþie ( argumente )

source: define a new conversion
ro: defineºte o nouã conversie

source: CREATE [DEFAULT] CONVERSION name FOR source_encoding TO dest_encoding FROM funcname
ro: CREATE [DEFAULT] CONVERSION nume FOR codificare_sursã TO codificare_destinaþie FROM nume_funcþie

source: create a new database
ro: creeazã o nouã bazã de date

source: CREATE DATABASE name [ [ WITH ] [ OWNER [=] dbowner ] [ TEMPLATE [=] template ] [ ENCODING [=] encoding ] [ TABLESPACE [=] tablespace ] ]
ro: CREATE DATABASE nume [ [ WITH ] [ OWNER [=] proprietar_bd ] [ TEMPLATE [=] ºablon ] [ ENCODING [=] codificare ] [ TABLESPACE [=] spaþiu_tabele ] ]

source: define a new domain
ro: defineºte un domeniu nou

source: CREATE DOMAIN name [AS] data_type [ DEFAULT expression ] [ constraint [ ... ] ] where constraint is: [ CONSTRAINT constraint_name ] { NOT NULL | NULL | CHECK (expression) }
ro: CREATE DOMAIN nume [AS] tip_date [ DEFAULT expresie ] [ restricþie [ ... ] ] unde restricþie este: [ CONSTRAINT nume_restricþie ] { NOT NULL | NULL | CHECK (expresie) }

source: define a new function
ro: defineºte o funcþie nouã

source: CREATE [ OR REPLACE ] FUNCTION name ( [ [ argname ] argtype [, ...] ] ) RETURNS rettype { LANGUAGE langname | IMMUTABLE | STABLE | VOLATILE | CALLED ON NULL INPUT | RETURNS NULL ON NULL INPUT | STRICT | [ EXTERNAL ] SECURITY INVOKER | [ EXTERNAL ] SECURITY DEFINER | AS 'definition' | AS 'obj_file', 'link_symbol' } ... [ WITH ( attribute [, ...] ) ]
ro: CREATE [ OR REPLACE ] FUNCTION nume ( [ [ nume_argument ] tip_argument [, ...] ] ) RETURNS tip_returnat { LANGUAGE nume_limbaj | IMMUTABLE | STABLE | VOLATILE | CALLED ON NULL INPUT | RETURNS NULL ON NULL INPUT | STRICT | [ EXTERNAL ] SECURITY INVOKER | [ EXTERNAL ] SECURITY DEFINER | AS 'definiþie' | AS 'fiºier_obiect', 'simbol_legãturã' } ... [ WITH ( atribut [, ...] ) ]

source: define a new user group
ro: defineºte un grup de utilizatori nou

source: CREATE GROUP name [ [ WITH ] option [ ... ] ] where option can be: SYSID gid | USER username [, ...]
ro: CREATE GROUP nume [ [ WITH ] opþiune [ ... ] ] unde opþiune poate fi: SYSID id_grup | USER nume_utilizator [, ...]

source: define a new index
ro: defineºte un index nou

source: CREATE [ UNIQUE ] INDEX name ON table [ USING method ] ( { column | ( expression ) } [ opclass ] [, ...] ) [ TABLESPACE tablespace ] [ WHERE predicate ]
ro: CREATE [ UNIQUE ] INDEX nume ON tabelã [ USING metodã ] ( { coloanã | ( expresie ) } [ clasã_operatori ] [, ...] ) [ TABLESPACE spaþiu_tabele ] [ WHERE predicat ]

source: define a new procedural language
ro: defineºte un limbaj procedural nou

source: CREATE [ TRUSTED ] [ PROCEDURAL ] LANGUAGE name HANDLER call_handler [ VALIDATOR valfunction ]
ro: CREATE [ TRUSTED ] [ PROCEDURAL ] LANGUAGE nume HANDLER rutinã_tratare_apel [ VALIDATOR funcþie_validare ]

source: define a new operator class
ro: defineºte o clasã de operatori nouã

source: CREATE OPERATOR CLASS name [ DEFAULT ] FOR TYPE data_type USING index_method AS { OPERATOR strategy_number operator_name [ ( op_type, op_type ) ] [ RECHECK ] | FUNCTION support_number funcname ( argument_type [, ...] ) | STORAGE storage_type } [, ... ]
ro: CREATE OPERATOR CLASS nume [ DEFAULT ] FOR TYPE tip_date USING metodã_index AS { OPERATOR numãr_strategie nume_operator [ ( tip_operator, tip_operator ) ] [ RECHECK ] | FUNCTION numãr_suport nume_funcþie ( tip_argument [, ...] ) | STORAGE tip_stocare } [, ... ]

source: define a new operator
ro: defineºte un operator nou

source: CREATE OPERATOR name ( PROCEDURE = funcname [, LEFTARG = lefttype ] [, RIGHTARG = righttype ] [, COMMUTATOR = com_op ] [, NEGATOR = neg_op ] [, RESTRICT = res_proc ] [, JOIN = join_proc ] [, HASHES ] [, MERGES ] [, SORT1 = left_sort_op ] [, SORT2 = right_sort_op ] [, LTCMP = less_than_op ] [, GTCMP = greater_than_op ] )
ro: CREATE OPERATOR nume ( PROCEDURE = nume_funcþie [, LEFTARG = tip_stânga ] [, RIGHTARG = tip_dreapta ] [, COMMUTATOR = operator_comutare ] [, NEGATOR = operator_negaþie ] [, RESTRICT = procedurã_restricþie ] [, JOIN = procedurã_relaþionare] [, HASHES ] [, MERGES ] [, SORT1 = operator_sortare_stânga ] [, SORT2 = operator_sortare_dreapta ] [, LTCMP = operator_mai_mic ] [, GTCMP = operator_mai_mare ] )

source: define a new rewrite rule
ro: defineºte o regulã nouã

source: CREATE [ OR REPLACE ] RULE name AS ON event TO table [ WHERE condition ] DO [ ALSO | INSTEAD ] { NOTHING | command | ( command ; command ... ) }
ro: CREATE [ OR REPLACE ] RULE nume AS ON eveniment TO tabelã [ WHERE condiþie ] DO [ ALSO | INSTEAD ] { NOTHING | comandã | ( comandã ; comandã ... ) }

source: define a new schema
ro: defineºte o schemã nouã

source: CREATE SCHEMA schemaname [ AUTHORIZATION username ] [ schema_element [ ... ] ] CREATE SCHEMA AUTHORIZATION username [ schema_element [ ... ] ]
ro: CREATE SCHEMA nume_schemã [ AUTHORIZATION nume_utilizator ] [ element_schemã [ ... ] ] CREATE SCHEMA AUTHORIZATION nume_utilizator [ element_schemã [ ... ] ]

source: define a new sequence generator
ro: defineºte un generator de secvenþã nou

source: CREATE [ TEMPORARY | TEMP ] SEQUENCE name [ INCREMENT [ BY ] increment ] [ MINVALUE minvalue | NO MINVALUE ] [ MAXVALUE maxvalue | NO MAXVALUE ] [ START [ WITH ] start ] [ CACHE cache ] [ [ NO ] CYCLE ]
ro: CREATE [ TEMPORARY | TEMP ] SEQUENCE nume [ INCREMENT [ BY ] increment ] [ MINVALUE valoare_ | NO MINVALUE ] [ MAXVALUE valoare_max | NO MAXVALUE ] [ START [ WITH ] start ] [ CACHE cache ] [ [ NO ] CYCLE ]

source: define a new table
ro: defineºte o tabelã nouã

source: CREATE [ [ GLOBAL | LOCAL ] { TEMPORARY | TEMP } ] TABLE table_name ( { column_name data_type [ DEFAULT default_expr ] [ column_constraint [ ... ] ] | table_constraint | LIKE parent_table [ { INCLUDING | EXCLUDING } DEFAULTS ] } [, ... ] ) [ INHERITS ( parent_table [, ... ] ) ] [ WITH OIDS | WITHOUT OIDS ] [ ON COMMIT { PRESERVE ROWS | DELETE ROWS | DROP } ] [ TABLESPACE tablespace ] where column_constraint is: [ CONSTRAINT constraint_name ] { NOT NULL | NULL | UNIQUE [ USING INDEX TABLESPACE tablespace ] | PRIMARY KEY [ USING INDEX TABLESPACE tablespace ] | CHECK (expression) | REFERENCES reftable [ ( refcolumn ) ] [ MATCH FULL | MATCH PARTIAL | MATCH SIMPLE ] [ ON DELETE action ] [ ON UPDATE action ] } [ DEFERRABLE | NOT DEFERRABLE ] [ INITIALLY DEFERRED | INITIALLY IMMEDIATE ] and table_constraint is: [ CONSTRAINT constraint_name ] { UNIQUE ( column_name [, ... ] ) [ USING INDEX TABLESPACE tablespace ] | PRIMARY KEY ( column_name [, ... ] ) [ USING INDEX TABLESPACE tablespace ] | CHECK ( expression ) | FOREIGN KEY ( column_name [, ... ] ) REFERENCES reftable [ ( refcolumn [, ... ] ) ] [ MATCH FULL | MATCH PARTIAL | MATCH SIMPLE ] [ ON DELETE action ] [ ON UPDATE action ] } [ DEFERRABLE | NOT DEFERRABLE ] [ INITIALLY DEFERRED | INITIALLY IMMEDIATE ]
ro: CREATE [ [ GLOBAL | LOCAL ] { TEMPORARY | TEMP } ] TABLE nume_tabelã ( { nume_coloanã tip_datã [ DEFAULT expresie_implicitã ] [ restricþie_coloanã [ ... ] ] | restricþie coloanã | LIKE tabelã_pãrinte [ { INCLUDING | EXCLUDING } DEFAULTS ] } [, ... ] ) [ INHERITS ( tabelã_pãrinte [, ... ] ) ] [ WITH OIDS | WITHOUT OIDS ] [ ON COMMIT { PRESERVE ROWS | DELETE ROWS | DROP } ] [ TABLESPACE spaþiu_tabele ] unde restricþie_coloanã este: [ CONSTRAINT nume_restricþie ] { NOT NULL | NULL | UNIQUE [ USING INDEX TABLESPACE spaþiu_tabele ] | PRIMARY KEY [ USING INDEX TABLESPACE spaþiu_tabele ] | CHECK (expresie) | REFERENCES tabelã_referitã [ ( coloanã_referitã ) ] [ MATCH FULL | MATCH PARTIAL | MATCH SIMPLE ] [ ON DELETE acþiune ] [ ON UPDATE acþiune ] } [ DEFERRABLE | NOT DEFERRABLE ] [ INITIALLY DEFERRED | INITIALLY IMMEDIATE ] ºi restricþie_tabelã este: [ CONSTRAINT nume_restricþie ] { UNIQUE ( nume_coloanã [, ... ] ) [ USING INDEX TABLESPACE spaþiu_tabele ] | PRIMARY KEY ( nume_coloanã [, ... ] ) [ USING INDEX TABLESPACE spaþiu_tabele ] | CHECK ( expresie ) | FOREIGN KEY ( nume_coloanã [, ... ] ) REFERENCES tabelã_referitã [ ( coloanã_referitã [, ... ] ) ] [ MATCH FULL | MATCH PARTIAL | MATCH SIMPLE ] [ ON DELETE acþiune ] [ ON UPDATE acþiune ] } [ DEFERRABLE | NOT DEFERRABLE ] [ INITIALLY DEFERRED | INITIALLY IMMEDIATE ]

source: define a new table from the results of a query
ro: defineºte o tabelã nouã din rezultatul unei interogãri

source: CREATE [ [ GLOBAL | LOCAL ] { TEMPORARY | TEMP } ] TABLE table_name [ (column_name [, ...] ) ] [ [ WITH | WITHOUT ] OIDS ] AS query
ro: CREATE [ [ GLOBAL | LOCAL ] { TEMPORARY | TEMP } ] TABLE nume_tabelã [ (nume_coloanã [, ...] ) ] [ [ WITH | WITHOUT ] OIDS ] AS interogare

source: define a new tablespace
ro: defineºte un spaþiu de tabele nou

source: CREATE TABLESPACE tablespacename [ OWNER username ] LOCATION 'directory'
ro: CREATE TABLESPACE nume_spaþiu_tabele [ OWNER utilizator ] LOCATION 'director'

source: define a new trigger
ro: defineºte un declanºator nou

source: CREATE TRIGGER name { BEFORE | AFTER } { event [ OR ... ] } ON table [ FOR [ EACH ] { ROW | STATEMENT } ] EXECUTE PROCEDURE funcname ( arguments )
ro: CREATE TRIGGER nume { BEFORE | AFTER } { eveniment [ OR ... ] } ON tabelã [ FOR [ EACH ] { ROW | STATEMENT } ] EXECUTE PROCEDURE nume_funcþie ( argumente )

source: define a new data type
ro: defineºte un tip de datã nou

source: CREATE TYPE name AS ( attribute_name data_type [, ... ] ) CREATE TYPE name ( INPUT = input_function, OUTPUT = output_function [ , RECEIVE = receive_function ] [ , SEND = send_function ] [ , ANALYZE = analyze_function ] [ , INTERNALLENGTH = { internallength | VARIABLE } ] [ , PASSEDBYVALUE ] [ , ALIGNMENT = alignment ] [ , STORAGE = storage ] [ , DEFAULT = default ] [ , ELEMENT = element ] [ , DELIMITER = delimiter ] )
ro: CREATE TYPE nume AS ( nume_atribut tip_datã [, ... ] ) CREATE TYPE nume ( INPUT = funcþie_intrare, OUTPUT = funcþie_ieºire [ , RECEIVE = funcþie_primire ] [ , SEND = functie_trimitere ] [ , ANALYZE = funcþie_analizã ] [ , INTERNALLENGTH = { lungime_internã | VARIABLE } ] [ , PASSEDBYVALUE ] [ , ALIGNMENT = aliniere ] [ , STORAGE = stocare ] [ , DEFAULT = implicit ] [ , ELEMENT = element ] [ , DELIMITER = delimitator ] )

source: define a new database user account
ro: defineºte un cont de utilizator de baze de date nou

source: CREATE USER name [ [ WITH ] option [ ... ] ] where option can be: SYSID uid | CREATEDB | NOCREATEDB | CREATEUSER | NOCREATEUSER | IN GROUP groupname [, ...] | [ ENCRYPTED | UNENCRYPTED ] PASSWORD 'password' | VALID UNTIL 'abstime'
ro: CREATE USER nume [ [ WITH ] opþiune [ ... ] ] unde opþiune poate fi: SYSID uid | CREATEDB | NOCREATEDB | CREATEUSER | NOCREATEUSER | IN GROUP nume_grup [, ...] | [ ENCRYPTED | UNENCRYPTED ] PASSWORD 'parolã' | VALID UNTIL 'timp_absolut'

source: define a new view
ro: defineºte o vizualizare nouã

source: CREATE [ OR REPLACE ] VIEW name [ ( column_name [, ...] ) ] AS query
ro: CREATE [ OR REPLACE ] VIEW nume [ ( nume_coloanã [, ...] ) ] AS interogare

source: deallocate a prepared statement
ro: de-alocã o instrucþiune preparatã

source: DEALLOCATE [ PREPARE ] plan_name
ro: DEALLOCATE [ PREPARE ] nume_plan

source: define a cursor
ro: defineºte un cursor

source: DECLARE name [ BINARY ] [ INSENSITIVE ] [ [ NO ] SCROLL ] CURSOR [ { WITH | WITHOUT } HOLD ] FOR query [ FOR { READ ONLY | UPDATE [ OF column [, ...] ] } ]
ro: DECLARE nume [ BINARY ] [ INSENSITIVE ] [ [ NO ] SCROLL ] CURSOR [ { WITH | WITHOUT } HOLD ] FOR interogare [ FOR { READ ONLY | UPDATE [ OF coloanã [, ...] ] } ]

source: delete rows of a table
ro: ºterge rândurile unei tabele

source: DELETE FROM [ ONLY ] table [ WHERE condition ]
ro: DELETE FROM [ ONLY ] tabelã [ WHERE condiþie ]

source: remove an aggregate function
ro: eliminã o funcþie de agregare

source: DROP AGGREGATE name ( type ) [ CASCADE | RESTRICT ]
ro: DROP AGGREGATE nume ( tip ) [ CASCADE | RESTRICT ]

source: remove a cast
ro: eliminã o conversie de tip

source: DROP CAST (sourcetype AS targettype) [ CASCADE | RESTRICT ]
ro: DROP CAST (tip_sursã AS tip_destinaþie) [ CASCADE | RESTRICT ]
