Repository: dvarrazzo/pgmessages
Catalog: */psql.po
Languages: ro

source: Warning: This syntax is deprecated.
ro: Avertisment: Aceastã sintaxã este depãºitã.

source: Invalid command \%s. Try \? for help.
ro: Comandã incorectã \%s. Încercaþi \? pentru ajutor.

source: invalid command \%s
ro: comandã incorectã \%s

source: \%s: extra argument "%s" ignored
ro: \%s: argument suplimentar "%s" ignorat

source: could not get home directory: %s
ro: imposibil de obþinut directorul de bazã: %s

source: \%s: could not change directory to "%s": %s
ro: \%s: imposibil de schimbat directorul în "%s": %s

source: no query buffer
ro: fãrã memorie tampon pentru interogãri

source: %s: invalid encoding name or conversion procedure not found
ro: %s: nume de codificare incorect sau procedurã de conversie negãsitã

source: \%s: missing required argument
ro: \%s: lipseºte argumentul solicitat

source: Query buffer is empty.
ro: Memoria tampon pentru interogãri este goalã.

source: Query buffer reset (cleared).
ro: Memoria tampon pentru interogãri reiniþializatã (curãþatã).

source: Wrote history to file "%s".
ro: Istoric scris în fiºierul "%s".

source: out of memory
ro: memorie insuficientã

source: \%s: error
ro: \%s: eroare

source: Timing is on.
ro: Cronometrare pornitã.

source: Timing is off.
ro: Cronometrare opritã.

source: Password:
ro: Parolã:

source: Previous connection kept
ro: Conexiune precedentã menþinutã

source: \connect: %s
ro: \conect: %s

source: You are now connected to database "%s".
ro: Sunteþi conectat la baza de date "%s".

source: You are now connected as new user "%s".
ro: Sunteþi conectat ca utilizatorul nou "%s".

source: You are now connected to database "%s" as user "%s".
ro: Sunteþi conectat la baza de date "%s" ca utilizatorul "%s".

source: could not start editor "%s"
ro: imposibil de pornit editorul "%s"

source: could not start /bin/sh
ro: imposibil de pornit /bin/sh

source: cannot locate temporary directory: %s
ro: imposibil de localizat directorul temporar: %s

source: could not open temporary file "%s": %s
ro: imposibil de deschis fiºierul temporar "%s": %s

source: \pset: allowed formats are unaligned, aligned, html, latex
ro: \pset: formatele permise sunt unaligned, aligned, html, latex

source: Output format is %s.
ro: Formatul de ieºire este %s.

source: Border style is %d.
ro: Stilul de bordurã este %d.

source: Expanded display is on.
ro: Afiºare extinsã pornitã.

source: Expanded display is off.
ro: Afiºare extinsã opritã.

source: Null display is "%s".
ro: Afiºarea nulã este "%s".

source: Field separator is "%s".
ro: Separatorul de câmpuri este "%s".

source: Record separator is <newline>.
ro: Separatorul de înregistrãri este <linienouã>.

source: Record separator is "%s".
ro: Separatorul de înregistrãri este "%s".

source: Showing only tuples.
ro: Afiºare doar liste de valori.

source: Tuples only is off.
ro: Lista de valori este dezactivatã.

source: Title is "%s".
ro: Titlul este "%s".

source: Title is unset.
ro: Titlul este anulat.

source: Table attribute is "%s".
ro: Atributul tabelei este "%s".

source: Table attributes unset.
ro: Atributul tabelei este anulat.

source: Pager is used for long output.
ro: Paginatorul este folosit pentru ieºirile lungi.

source: Pager is always used.
ro: Paginatorul este folosit tot timpul.

source: Pager usage is off.
ro: Folosire paginator opritã.

source: Default footer is on.
ro: Subsolul implicit este pornit.

source: Default footer is off.
ro: Subsolul implicit este oprit.

source: \pset: unknown option: %s
ro: \pset: opþiune necunoscutã: %s

source: \!: failed
ro: \!: eºuat

source: %s: xstrdup: cannot duplicate null pointer (internal error)
ro: %s: xstrdup: imposibil de duplicat un pointer nul (eroare internã)

source: out of memory
ro: memorie insuficientã

source: connection to server was lost
ro: conexiunea la server a fost pierdutã

source: The connection to the server was lost. Attempting reset:
ro: Conexiunea la server a fost pierdutã. Se încearcã reiniþializarea:

source: Failed.
ro: Eºuat.

source: Succeeded.
ro: Reuºit.

source: INTERNAL ERROR: unexpected statement position "%s"
ro: EROARE INTERNÃ: poziþie neaºteptatã a instrucþiunii "%s"

source: LINE %d:
ro: LINIE %d:

source: You are currently not connected to a database.
ro: Nu sunteþi conectat la o bazã de date.

source: Asynchronous notification "%s" received from server process with PID %d.
ro: Notificare asincronã "%s" recepþionatã de la procesul serverului cu PID %d.

source: ***(Single step mode: verify command)******************************************* %s ***(press return to proceed or enter x and return to cancel)********************
ro: ***(Mod cu un singur pas: verificare comandã)***************************************** %s ***(apãsaþi Enter pentru continuare sau x ºi Enter pentru anulare)********************

source: Time: %.3f ms
ro: Timp: %.3f ms

source: \copy: arguments required
ro: \copy: argumente necesare

source: \copy: parse error at "%s"
ro: \copy: eroare de analizare la "%s"

source: \copy: parse error at end of line
ro: \copy: eroare de analizare la sfârºitul liniei

source: %s: cannot copy from/to a directory
ro: %s: imposibil de copiat într-un/dintr-un director

source: \copy: unexpected response (%d)
ro: \copy: rãspuns neaºteptat (%d)

source: Enter data to be copied followed by a newline. End with a backslash and a period on a line by itself.
ro: Introduceþi datele de copiat urmate de o linie nouã. Terminaþi cu un backslash ºi un punct singure pe o linie.

source: on
ro: pornit

source: off
ro: oprit

source: could not get current user name: %s
ro: imposibil de determinat numele utilizatorului curent: %s

source: This is psql %s, the PostgreSQL interactive terminal.
ro: Acesta este psql %s, terminalul interactiv pentru PostgreSQL.

source: Usage:
ro: Utilizare:

source: psql [OPTIONS]... [DBNAME [USERNAME]]
ro: psql [OPÞIUNI]... [NUMEBD [NUMEUTILIZATOR]]

source: General options:
ro: Opþiuni generale:

source: -d DBNAME specify database name to connect to (default: "%s")
ro: -d NUMEBD specificã numele bazei de date pentru conectare (implicit: "%s")

source: -c COMMAND run only single command (SQL or internal) and exit
ro: -c COMANDÃ ruleazã o singurã comandã (SQL sau internã), apoi iese

source: -f FILENAME execute commands from file, then exit
ro: -f NUMEFIªIER executã comenzile din fiºier, apoi iese

source: -l list available databases, then exit
ro: -l enumerã bazele de date disponibile, apoi iese

source: -v NAME=VALUE set psql variable NAME to VALUE
ro: -v NUME=VALOARE seteazã variabila psql NUME la VALOARE

source: -X do not read startup file (~/.psqlrc)
ro: -X nu se citeºte fiºierul de pornire (~/.psqlrc)

source: --help show this help, then exit
ro: --help afiºeazã acest ajutor, apoi iese

source: --version output version information, then exit
ro: --version afiºeazã informaþiile despre versiune, apoi iese

source: Input and output options:
ro: Opþiuni pentru intrare ºi ieºire:

source: -a echo all input from script
ro: -a afiºeazã toate intrãrile din script

source: -e echo commands sent to server
ro: -e afiºeazã comenzile trimise serverului

source: -E display queries that internal commands generate
ro: -E afiºeazã interogãrile generate de comenzile interne

source: -q run quietly (no messages, only query output)
ro: -q ruleazã în mod silenþios (fãrã mesaje, doar ieºirile interogãrilor)

source: -o FILENAME send query results to file (or |pipe)
ro: -o NUMEFIªIER trimite rezultatele interogãrilor în fiºier (sau |conductã)

source: -n disable enhanced command line editing (readline)
ro: -n dezactiveazã editarea extinsã a liniei de comandã (readline)

source: -s single-step mode (confirm each query)
ro: -s mod cu un pas (se confirmã fiecare interogare)

source: -S single-line mode (end of line terminates SQL command)
ro: -S mod cu o singurã linie (sfârºitul de linie terminã comanda SQL)

source: Output format options:
ro: Opþiuni pentru formatarea ieºirii:

source: -A unaligned table output mode (-P format=unaligned)
ro: -A mod tabel nealiniat (-P format=unaligned)

source: -H HTML table output mode (-P format=html)
ro: -H mod tabel HTML (-P format=html)

source: -t print rows only (-P tuples_only)
ro: -t afiºare numai rânduri (-P tuples_only)

source: -T TEXT set HTML table tag attributes (width, border) (-P tableattr=)
ro: -T TEXT seteazã atributele etichetei HTML pentru tabelã (lãþime, bordurã) (-P tableattr=)

source: -x turn on expanded table output (-P expanded)
ro: -x activeazã ieºirea tabel extins (-P expanded)

source: -P VAR[=ARG] set printing option VAR to ARG (see \pset command)
ro: -P VAR[=ARG] seteazã opþiunea de afiºare VAR la ARG (vezi comanda \pset)

source: -F STRING set field separator (default: "%s") (-P fieldsep=)
ro: -F ªIR seteazã separatorul de câmp (implicit: "%s") (-P fieldsep=)

source: -R STRING set record separator (default: newline) (-P recordsep=)
ro: -R ªIR seteazã separatorul de înregistrare (implicit: linie nouã) (-P recordsep=)

source: Connection options:
ro: Opþiuni pentru conectare:

source: -h HOSTNAME database server host or socket directory (default: "%s")
ro: -h NUMEGAZDÃ gazda serverului de baze de date sau directorul soclului (implicit: "%s")

source: local socket
ro: soclu local

source: -p PORT database server port (default: "%s")
ro: -p PORT portul serverului de baze de date (implicit: "%s")

source: -U NAME database user name (default: "%s")
ro: -U NUME numele utilizatorului bazei de date (implicit: "%s")

source: -W prompt for password (should happen automatically)
ro: -W solicitã parola (în mod normal, se face automat)

source: For more information, type "\?" (for internal commands) or "\help" (for SQL commands) from within psql, or consult the psql section in the PostgreSQL documentation. Report bugs to <pgsql-bugs@postgresql.org>.
ro: Pentru mai multe informaþii, tastaþi "\?" (pentru comenzi interne) sau "\help" (pentru comenzi SQL) din psql, sau consultaþi secþiunea psql din documentaþia de PostgreSQL. Raportaþi erorile la <pgsql-bugs@postgresql.org>.

source: \c[onnect] [DBNAME|- [USER]] connect to new database (currently "%s")
ro: \c[onnect] [NUMEBD|- [UTILIZATOR]] conectare la o nouã bazã de date (în prezent "%s")

source: \cd [DIR] change the current working directory
ro: \cd [DIR] schimbã directorul de lucru curent

source: \copyright show PostgreSQL usage and distribution terms
ro: \copyright afiºeazã termenii de folosire ºi de distribuþie a PostgreSQL

source: \encoding [ENCODING] show or set client encoding
ro: \encoding [CODIFICARE] afiºeazã sau seteazã codificarea clientului

source: \h [NAME] help on syntax of SQL commands, * for all commands
ro: \h [NUME] ajutor pentru sintaxa comenzilor SQL, * pentru toate comenzile

source: \q quit psql
ro: \q terminare psql

source: \set [NAME [VALUE]] set internal variable, or list all if no parameters
ro: \set [NUME [VALOARE]] seteazã o variabilã internã sau le afiºeazã pe toate dacã nu sunt furnizaþi parametri

source: \timing toggle timing of commands (currently %s)
ro: \timing comutã cronometrarea comenzilor (în prezent %s)

source: \unset NAME unset (delete) internal variable
ro: \unset NUME reseteazã (ºterge) variabila internã

source: \! [COMMAND] execute command in shell or start interactive shell
ro: \! [COMANDÃ] executã comanda în interpretor sau porneºte un interpretor interactiv

source: Query Buffer
ro: Memorie tampon pentru interogãri

source: \e [FILE] edit the query buffer (or file) with external editor
ro: \e [FIªIER] editeazã memoria tampon pentru interogãri (sau fiºierul) cu un editor extern

source: \g [FILE] send query buffer to server (and results to file or |pipe)
ro: \g [FIªIER] trimite memoria tampon pentru interogãri serverului (ºi rezultatele într-un fiºier sau |conductã)

source: \p show the contents of the query buffer
ro: \p afiºeazã conþinutul memoriei tampon pentru interogãri

source: \r reset (clear) the query buffer
ro: \r reseteazã (ºterge) memoria tampon pentru interogãri

source: \s [FILE] display history or save it to file
ro: \s [FIªIER] afiºeazã istoricul sau îl salveazã în fiºier

source: \w FILE write query buffer to file
ro: \w FIªIER scrie memoria tampon pentru interogãri în fiºier

source: Input/Output
ro: Intrare/Ieºire

source: \echo [STRING] write string to standard output
ro: \echo [ªIR] afiºeazã ºirul la ieºirea standard

source: \i FILE execute commands from file
ro: \i FIªIER executã comenzile din fiºier

source: \o [FILE] send all query results to file or |pipe
ro: \o [FIªIER] salveazã toate rezultatele interogãrilor în fiºier sau |conductã

source: \qecho [STRING] write string to query output stream (see \o)
ro: \qecho [ªIR] scrie ºirul în fluxul de ieºire al interogãrilor (vezi \o)

source: Informational
ro: Informaþional

source: \d [NAME] describe table, index, sequence, or view
ro: \d [NUME] descrie tabela, indexul, secvenþa sau vizualizarea

source: \d{t|i|s|v|S} [PATTERN] (add "+" for more detail) list tables/indexes/sequences/views/system tables
ro: \d{t|i|s|v|S} [MODEL] (adãugaþi "+" pentru mai multe detalii) listeazã tabelele/indexuri/secvenþele/vizualizãrile/tabelele sistem

source: \da [PATTERN] list aggregate functions
ro: \da [MODEL] listeazã funcþiile de agregare

source: \db [PATTERN] list tablespaces (add "+" for more detail)
ro: \db [MODEL] listeazã spaþiile de tabele (adãugaþi "+" pentru mai multe detalii)

source: \dc [PATTERN] list conversions
ro: \dc [MODEL] listeazã conversiile

source: \dC list casts
ro: \dC listeazã conversiile de tip

source: \dd [PATTERN] show comment for object
ro: \dd [MODEL] afiºeazã comentariile pentru obiecte

source: \dD [PATTERN] list domains
ro: \dD [MODEL] listeazã domeniile

source: \df [PATTERN] list functions (add "+" for more detail)
ro: \df [MODEL] listeazã funcþiile (adãugaþi "+" pentru mai multe detalii)

source: \dg [PATTERN] list groups
ro: \dg [MODEL] listeazã grupurile

source: \dn [PATTERN] list schemas (add "+" for more detail)
ro: \dn [MODEL] listeazã schemele (adãugaþi "+" pentru mai multe detalii)

source: \do [NAME] list operators
ro: \do [NUME] listeazã operatorii

source: \dl list large objects, same as \lo_list
ro: \dl listeazã obiectele mari, similar cu \lo_list

source: \dp [PATTERN] list table, view, and sequence access privileges
ro: \dp [MODEL] listeazã drepturile de acces pentru tabele, vizualizãri ºi secvenþe

source: \dT [PATTERN] list data types (add "+" for more detail)
ro: \dT [MODEL] listeazã tipurile de date (adãugaþi "+" pentru mai multe detalii)

source: \du [PATTERN] list users
ro: \du [MODEL] listeazã utilizatorii

source: \l list all databases (add "+" for more detail)
ro: \l listeazã toate bazele de date (adãugaþi "+" pentru mai multe detalii)

source: \z [PATTERN] list table, view, and sequence access privileges (same as \dp)
ro: \z [MODEL] listeazã drepturile de acces pentru tabele, vizualizãri ºi secvenþe (similar cu \dp)

source: Formatting
ro: Formatare

source: \a toggle between unaligned and aligned output mode
ro: \a comutã între modurile de ieºire aliniat ºi nealiniat

source: \C [STRING] set table title, or unset if none
ro: \C [ªIR] seteazã titlul tabelei, sau îl reseteazã dacã nu este specificatã valoarea

source: \f [STRING] show or set field separator for unaligned query output
ro: \f [ªIR] afiºeazã sau seteazã separatorul pentru ieºirea nealiniatã a interogãrii

source: \H toggle HTML output mode (currently %s)
ro: \H comutã modul de ieºire HTML (în prezent %s)

source: \pset NAME [VALUE] set table output option (NAME := {format|border|expanded|fieldsep|footer|null| recordsep|tuples_only|title|tableattr|pager})
ro: \pset NUME [VALOARE] seteazã opþiunea de ieºire pentru tabelã (NUME := {format|border|expanded|fieldsep|footer|null| recordsep|tuples_only|title|tableattr|pager})

source: \t show only rows (currently %s)
ro: \t afiºeazã numai rânduri (în prezent %s)

source: \T [STRING] set HTML <table> tag attributes, or unset if none
ro: \T [ªIR] seteazã atributele tag-ului HTML <table>, sau le reseteazã dacã nu este specificatã o valoare

source: \x toggle expanded output (currently %s)
ro: \x comutã modul de ieºire extins (în prezent %s)

source: Copy, Large Object
ro: Copiere, Obiecte Mari

source: \copy ... perform SQL COPY with data stream to the client host
ro: \copy ... executã SQL COPY cu fluxul de date cãtre gazda clientului

source: \lo_export LOBOID FILE \lo_import FILE [COMMENT] \lo_list \lo_unlink LOBOID large object operations
ro: \lo_export OID_OBM FIªIER \lo_import FIªIER [COMENTARIU] \lo_list \lo_unlink OID_OBM operaþiuni cu obiecte mari

source: Available help:
ro: Ajutor disponibil:

source: Command: %s Description: %s Syntax: %s
ro: Comandã: %s Descriere: %s Sintaxã: %s

source: No help available for "%-.*s". Try \h with no arguments to see available help.
ro: Nu existã ajutor disponibil pentru "%-.*s". Încercaþi \h fãrã argumente pentru a vedea ajutorul disponibil.

source: could not save history to file "%s": %s
ro: imposibil de salvat istoricul în fiºierul "%s": %s

source: history is not supported by this installation
ro: istoricul nu este suportat de aceastã instalare

source: %s: not connected to a database
ro: %s: neconectat la o bazã de date

source: %s: current transaction is aborted
ro: %s: tranzacþia curentã este abandonatã

source: %s: unknown transaction status
ro: %s: stare a tranzacþiei necunoscutã

source: Description
ro: Descriere

source: Large objects
ro: Obiecte mari

source: Use "\q" to leave %s.
ro: Folosiþi "\q" pentru a pãrãsi %s.

source: (No rows)
ro: (Nici un rând)

source: (1 row)
ro: (1 rând)

source: (%d rows)
ro: (%d rânduri)

source: %s: out of memory
ro: %s: memorie insuficientã

source: User name:
ro: Nume utilizator:

source: Welcome to %s %s, the PostgreSQL interactive terminal. Type: \copyright for distribution terms \h for help with SQL commands \? for help with psql commands \g or terminate with semicolon to execute query \q to quit
ro: Bun venit în %s %s, terminalul interactiv PostgreSQL . Tastaþi: \copyright pentru termenii de distribuþie \h pentru ajutor cu comenzile SQL \? pentru ajutor cu comenzile psql \g sau terminaþi cu punct si virgulã pentru a executa interogarea \q pentru terminare

source: %s: couldn't set printing parameter "%s"
ro: %s: imposibil de setat parametrul de imprimare "%s"

source: %s: could not delete variable "%s"
ro: %s: imposibil de ºters variabila "%s"

source: %s: could not set variable "%s"
ro: %s: imposibil de setat variabila "%s"

source: Try "%s --help" for more information.
ro: Încercaþi "%s --help" pentru mai multe informaþii.

source: %s: warning: extra command-line argument "%s" ignored
ro: %s: avertisment: argument în linia de comandã suplimentar "%s" ignorat

source: %s: Warning: The -u option is deprecated. Use -U.
ro: %s: Avertisment: Opþiunea -u este depãºitã. Folosiþi -U.

source: contains support for command-line editing
ro: conþine suport pentru editarea liniei de comandã

source: SSL connection (cipher: %s, bits: %i)
ro: Conexiune SSL (cifru: %s, biþi: %i)

source: Warning: Console code page (%u) differs from Windows code page (%u) 8-bit characters may not work correctly. See psql reference page "Notes for Windows users" for details.
ro: Avertisment: Pagina de coduri a consolei (%u) este diferitã de pagina de coduri Windows (%u) caracterele pe 8 biþi ar putea sã nu fie corect afiºate. Consultaþi pagina de referinþã psql "Notes for Windows users" pentru mai multe detalii.

source: Schema
ro: Schemã

source: Name
ro: Nume

source: (all types)
ro: (toate tipurile)

source: Data type
ro: Tip de datã

source: List of aggregate functions
ro: Lista funcþiilor de agregare

source: The server version (%d) does not support tablespaces.
ro: Versiunea de server (%d) nu suportã spaþii de tabele.

source: Owner
ro: Proprietar

source: Location
ro: Locaþie

source: Access privileges
ro: Drepturi de acces

source: List of tablespaces
ro: Lista spaþiilor de tabele

source: Result data type
ro: Tip de datã pentru rezultat

source: Argument data types
ro: Tipuri de datã pentru argument

source: Language
ro: Limbã

source: Source code
ro: Cod sursã

source: List of functions
ro: Lista funcþiilor

source: Internal name
ro: Nume intern

source: Size
ro: Mãrime

source: List of data types
ro: Lista tipurilor de date

source: Left arg type
ro: Tipul argumentului stâng

source: Right arg type
ro: Tipul argumentului drept

source: Result type
ro: Tipul rezultatului

source: List of operators
ro: Lista operatorilor

source: Encoding
ro: Codificare

source: List of databases
ro: Lista bazelor de date

source: table
ro: tabelã

source: view
ro: vizualizare

source: sequence
ro: secvenþã

source: Type
ro: Tip

source: Access privileges for database "%s"
ro: Drepturi de acces pentru baza de date "%s"

source: Object
ro: Obiect

source: aggregate
ro: agregat

source: function
ro: funcþie

source: data type
ro: tip de datã

source: rule
ro: regulã

source: trigger
ro: declanºator

source: Object descriptions
ro: Descrierile obiectului

source: Did not find any relation named "%s".
ro: Imposibil de gãsit o relaþie numitã "%s".

source: Did not find any relation with OID %s.
ro: Imposibil de gãsit o relaþie cu OID %s.

source: Column
ro: Coloanã

source: Modifiers
ro: Modificatori

source: Table "%s.%s"
ro: Tabelã "%s.%s"

source: View "%s.%s"
ro: Vizualizare "%s.%s"

source: Sequence "%s.%s"
ro: Secvenþã "%s.%s"

source: Special relation "%s.%s"
ro: Relaþie specialã "%s.%s"

source: TOAST table "%s.%s"
ro: Tabelã TOAST "%s.%s"

source: Composite type "%s.%s"
ro: Tip compus "%s.%s"

source: primary key,
ro: cheie primarã,

source: unique,
ro: unic,

source: for table "%s.%s"
ro: pentru tabela "%s.%s"

source: , predicate (%s)
ro: , predicat (%s)

source: , clustered
ro: , grupat

source: View definition: %s
ro: Definiþie vizualizare: %s

source: Rules:
ro: Reguli:

source: Indexes:
ro: Indexuri:

source: Check constraints:
ro: Verificare restricþii:

source: Foreign-key constraints:
ro: Restricþii de cheie strãinã:

source: Triggers:
ro: Declanºatori:

source: Inherits
ro: Moºteneºte

source: Has OIDs
ro: Are OID-uri

source: yes
ro: da

source: no
ro: nu

source: Tablespace: "%s"
ro: Spaþiu de tabele: "%s"

source: User name
ro: Nume utilizator

source: User ID
ro: ID utilizator

source: superuser, create database
ro: utilizator privilegiat, creare bazã de date

source: superuser
ro: utilizator privilegiat

source: create database
ro: creare bazã de date

source: Attributes
ro: Atribute

source: Groups
ro: Grupuri

source: List of users
ro: Lista utilizatorilor

source: Group name
ro: Nume grup

source: Group ID
ro: ID grup

source: List of groups
ro: Lista grupurilor

source: Table
ro: Tabelã

source: No matching relations found.
ro: Nici o relaþie potrivitã gasitã.

source: No relations found.
ro: Nici o relaþie gãsitã.

source: List of relations
ro: Lista relaþiilor

source: Modifier
ro: Modificator

source: List of domains
ro: Lista domeniilor

source: Source
ro: Sursã

source: Destination
ro: Destinaþie

source: Default?
ro: Implicit?

source: List of conversions
ro: Lista conversiilor

source: Source type
ro: Tip sursã

source: Target type
ro: Tip destinaþie

source: (binary compatible)
ro: (compatibil binar)

source: Function
ro: Funcþie

source: in assignment
ro: în alocare

source: List of casts
ro: Lista conversiilor de tip

source: List of schemas
ro: Lista schemelor

source: abort the current transaction
ro: abandoneazã tranzacþia curentã

source: change the definition of an aggregate function
ro: modificã definiþia unei funcþii de agregare

source: ALTER AGGREGATE name ( type ) RENAME TO newname ALTER AGGREGATE name ( type ) OWNER TO newowner
ro: ALTER AGGREGATE nume ( tip ) RENAME TO nume_nou ALTER AGGREGATE nume ( tip ) OWNER TO proprietar_nou

source: change the definition of a conversion
ro: modificã definiþia unei conversii
